pwg-pwg/test/IVPMP2G2-PRO_APP/trunk/01_SourceCode/08_F2837xS_IVPMP2G2_APP/Source/APP/Initial.c
void    sInitialDSP(void)
{
    sInitSysCtrl();
    // Disable and clear all CPU interrupts:
    DINT;
    IER = 0x0000;
    IFR = 0x0000;

    // Initialize Pie Control Registers To Default State:
    // This function is found in the DSP28_PieCtrl.c file.
    sInitPieCtrl();

    // Initialize the PIE Vector Table To a Known State:
    // This function is found in DSP28_PieVect.c.
    // This function populates the PIE vector table with pointers
    // to the shell ISR functions found in DSP28_DefaultIsr.c.
    InitPieVectTable();

    //sInitFlash();
    sFlashIapInit();

	sModelIdentify();

    // Step 2. Initialize EPWM registers for the specific application
    sInitEpwm();
	
    sInitEcap();

    // Step 3. Initialize AD registers
    sInitAdc();

    // Step 4. Select GPIO for the device or for the specific application:
    sInitGpio();

    // Step 5. Initialize SCI registers
    sInitSci();

    // Step 6. Initialize CAN registers
    //sInitCAN();
    sInitCan(cPrioPara,eParaCANParsing);

    // Step 7. Initialize SPI registers
    //sInitSPI();

    // Step 8. Initialize CMPSS
    sInitCmpss();

	// Step 9. Initialize XINT5
    sInitXint5();

    sInitCpuTimers();                       // For this example, only initialize the Cpu Timers
    sConfigCpuTimer(&CpuTimer0, 200, 500);  // 120MHz,0.5ms
    CpuTimer0Regs.TCR.all = 0x4000;         // Use write-only instruction to set TSS bit = 0

    EALLOW;  // This is needed to write to EALLOW protected registers
    PieVectTable.EPWM1_INT = &INVInterrupt;
    PieVectTable.TIMER0_INT = &OSTimeBase;
    PieVectTable.EPWM2_INT = &MPPTInterrupt;
    PieVectTable.USER12_INT = &OSCtxSw;
    PieVectTable.ECAP1_INT = &LineZeroCrossInterrupt;
    PieVectTable.ECAP2_INT = &SynchroZeroCrossInterrupt;
    PieVectTable.ECAP3_INT = &GenZeroCrossInterrupt;
    //PieVectTable.SCIA_RX_INT = &SCIAReceiveInterrupt;
    //PieVectTable.SCIA_TX_INT = &SCIATransmitInterrupt;
    PieVectTable.SCIB_RX_INT = &SCIBReceiveInterrupt;
    PieVectTable.SCIB_TX_INT = &SCIBTransmitInterrupt;
    PieVectTable.SCIC_RX_INT = &SCICReceiveInterrupt;
    PieVectTable.SCIC_TX_INT = &SCICTransmitInterrupt;
    PieVectTable.CANA0_INT = &CANInterrupt;
	PieVectTable.XINT5_INT = &XINT5Interrupt;
    //PieVectTable.CANA0_INT = &canaISR;
    EDIS;    // This is needed to disable write to EALLOW protected registers

    // Enable CPU INT3 which is connected to EPWM1-6 INT:
    IER |=( M_INT1 | M_INT3 | M_INT4 | M_INT8 | M_INT9 | M_INT12);

    // Enable TINT0 in the PIE: Group 1 interrupt 7
    PieCtrlRegs.PIEIER1.bit.INTx7 = 1; //timer0

    // Enable EPWM INTn in the PIE: Group 3 interrupt 1-6
    PieCtrlRegs.PIEIER3.bit.INTx1 = 1;       //inverter pwm1
    //PieCtrlRegs.PIEIER3.bit.INTx6 = 1;       //time basse
    PieCtrlRegs.PIEIER3.bit.INTx2 = 1;       //boost   pwm2

    //Enable PIE group 4 interrupt 1,2,3for eCAP1,2,3
    PieCtrlRegs.PIEIER4.bit.INTx1 = 1;
    PieCtrlRegs.PIEIER4.bit.INTx2 = 1;
    PieCtrlRegs.PIEIER4.bit.INTx3 = 1;

    PieCtrlRegs.PIEIER8.bit.INTx5 = 1;//SCIC_RX
    PieCtrlRegs.PIEIER8.bit.INTx6 = 1;//SCIC_TX

    //Enable PIE group 9 interrupt 1,2 for SCIA
    //interrupt 5 for CANA,3,4for scib
    //PieCtrlRegs.PIEIER9.bit.INTx1 = 1;//SCIA_RX
    //PieCtrlRegs.PIEIER9.bit.INTx2 = 1;
    PieCtrlRegs.PIEIER9.bit.INTx3 = 1;//SCIB_RX
    PieCtrlRegs.PIEIER9.bit.INTx4 = 1;
    PieCtrlRegs.PIEIER9.bit.INTx5 = 1;//CANA0

	PieCtrlRegs.PIEIER12.bit.INTx3 = 1;//XINT5

    // Enable global Interrupts and higher priority real-time debug events:
    //EINT;   // Enable Global interrupt INTM
    //ERTM;   // Enable Global realtime interrupt DBGM

    sDisplayDevInit();
    sSet50HzParameter();
    sUpsParaInit();
    sFBINVPFCInitial();
    Spll_Init();
	sFaultAlarmInit();
	sPvModuleInit();
}

// This function initializes the Flash Control registers
//                   CAUTION
// This function MUST be executed out of RAM. Executing it
// out of OTP/Flash will yield unpredictable results

void sInitFlash(void)
{
    EALLOW;

        //
        // At reset bank and pump are in sleep. A Flash access will power up the
        // bank and pump automatically.
        //
        // Power up Flash bank and pump. This also sets the fall back mode of
        // flash and pump as active.
        //
        Flash0CtrlRegs.FPAC1.bit.PMPPWR = 0x1;
        Flash0CtrlRegs.FBFALLBACK.bit.BNKPWR0 = 0x3F;

        //
        // Disable Cache and prefetch mechanism before changing wait states
        //
        Flash0CtrlRegs.FRD_INTF_CTRL.bit.DATA_CACHE_EN = 0;
        Flash0CtrlRegs.FRD_INTF_CTRL.bit.PREFETCH_EN = 0;

        //
        // Set waitstates according to frequency
        //
        //      *CAUTION*
        // Minimum waitstates required for the flash operating at a given CPU rate
        // must be characterized by TI. Refer to the datasheet for the latest
        // information.
        //
    #if CPU_FRQ_120MHZ
            Flash0CtrlRegs.FRDCNTL.bit.RWAIT = 0x5;
    #endif

        //
        // Enable Cache and prefetch mechanism to improve performance of code
        // executed from Flash.
        //
        Flash0CtrlRegs.FRD_INTF_CTRL.bit.DATA_CACHE_EN = 1;
        Flash0CtrlRegs.FRD_INTF_CTRL.bit.PREFETCH_EN = 1;

        //
        // At reset, ECC is enabled. If it is disabled by application software and
        // if application again wants to enable ECC.
        //
        Flash0EccRegs.ECC_ENABLE.bit.ENABLE = 0xA;

        EDIS;

        //
        // Force a pipeline flush to ensure that the write to the last register
        // configured occurs before returning.
        //
        __asm(" RPT #7 || NOP");
}

//
// SetVREF - Set Vref mode. Function to select reference mode and offset trim.
// Offset trim for Internal VREF 3.3 is unique.  All other modes use the same
// offset trim. Also note that when the mode parameter is ADC_EXTERNAL, the
// ref parameter has no effect.
//
// In this device, the bandgaps are common for all the ADC instances,
// hence common Vref configuration needs to be done for all the ADCs. This
// API configures same Vref configuration for all the supported ADCs in the
// device.
//
/*
void sSetVREF(int module, int mode, int ref)
{
    Uint16 *offset, offsetShiftVal;

    if((mode == ADC_INTERNAL) && (ref == ADC_VREF3P3))
    {
        offsetShiftVal = 8U;         // Internal / 1.65v mode offset
    }
    else
    {
        offsetShiftVal = 0U;        // All other modes
    }

    //
    // Set up pointer to offset trim in OTP for ADCA.
    //
    offset = (Uint16 *)((Uint32)0x7016CU);

    EALLOW;

    //
    // Get offset trim from OTP and write it to the register for ADCA.
    //
    AdcaRegs.ADCOFFTRIM.bit.OFFTRIM = (*offset >> offsetShiftVal) & 0xFFU;

    //
    // Set up pointer to offset trim in OTP for ADCC.
    //
    offset = (Uint16 *)((Uint32)0x7016EU);

    //
    // Get offset trim from OTP and write it to the register for ADCC.
    //
    AdccRegs.ADCOFFTRIM.bit.OFFTRIM = (*offset >> offsetShiftVal) & 0xFFU;

    //
    // Configure the reference mode for all ADCs (internal or external).
    //
    //AnalogSubsysRegs.ANAREFCTL.bit.ANAREFSEL = mode;

    //
    // Configure the reference voltage for all ADCs (3.3V or 2.5V).
    //
    //AnalogSubsysRegs.ANAREFCTL.bit.ANAREF2P5SEL = ref;

    EDIS;
}
*/
//---------------------------------------------------------------------------
// InitAdc:
//---------------------------------------------------------------------------
// This function initializes ADC to a known state.
//
void sInitAdc(void)
{
    // *IMPORTANT*
    // The Device_cal function, which copies the ADC calibration values from TI reserved
    // OTP into the ADCREFSEL and ADCOFFTRIM registers, occurs automatically in the
    // Boot ROM. If the boot ROM code is bypassed during the debug process, the
    // following function MUST be called for the ADC to function according
    // to specification. The clocks to the ADC MUST be enabled before calling this
    // function.
    // See the device data manual and/or the ADC Reference
    // Manual for more information.

    EALLOW;

	AdcaRegs.ADCCTL2.bit.PRESCALE = 0x06;
    AdcbRegs.ADCCTL2.bit.PRESCALE = 0x06;
    AdccRegs.ADCCTL2.bit.PRESCALE = 0x06;
	AdcdRegs.ADCCTL2.bit.PRESCALE = 0x06;

	AdcSetMode(ADC_ADCA, ADC_RESOLUTION_12BIT, ADC_SIGNALMODE_SINGLE);
	AdcSetMode(ADC_ADCB, ADC_RESOLUTION_12BIT, ADC_SIGNALMODE_SINGLE);
	AdcSetMode(ADC_ADCC, ADC_RESOLUTION_12BIT, ADC_SIGNALMODE_SINGLE);
	AdcSetMode(ADC_ADCD, ADC_RESOLUTION_12BIT, ADC_SIGNALMODE_SINGLE);

  	//Set pulse positions to late
    AdcaRegs.ADCCTL1.bit.INTPULSEPOS = 1;
    AdcbRegs.ADCCTL1.bit.INTPULSEPOS = 1;
    AdccRegs.ADCCTL1.bit.INTPULSEPOS = 1;
	AdcdRegs.ADCCTL1.bit.INTPULSEPOS = 1;

    // Power up the ADC
    AdcaRegs.ADCCTL1.bit.ADCPWDNZ = 1;
    AdcbRegs.ADCCTL1.bit.ADCPWDNZ = 1;
    AdccRegs.ADCCTL1.bit.ADCPWDNZ = 1;
	AdcdRegs.ADCCTL1.bit.ADCPWDNZ = 1;
	
