pwg-pwg/test/IVPMP2G2-PRO_APP/trunk/01_SourceCode/08_F2837xS_IVPMP2G2_APP/Source/APP/Initial.c
	sDelay1ms(100);
	
    EDIS;

    // Delay before converting ADC channels
    
	//DELAY_US(1000);
	

    EALLOW;

    //Sample mode
    //AdcaRegs.ADCSOCPRICTL.bit.ONESHOT = 1;// One-shot mode enabled

    // 1101 1111 1001 0011  = 0XDF93;
    AdcaRegs.ADCSOC0CTL.bit.CHSEL= 0;       // SOC0 will convert ADCINA0
    AdcaRegs.ADCSOC1CTL.bit.CHSEL= 1;       // SOC1 will convert ADCINA1
    AdcaRegs.ADCSOC2CTL.bit.CHSEL= 2;       // SOC2 will convert ADCINA2
    AdcaRegs.ADCSOC3CTL.bit.CHSEL= 3;       // SOC3 will convert ADCINA3
    AdcaRegs.ADCSOC4CTL.bit.CHSEL= 4;       // SOC4 will convert ADCINA4
    AdcaRegs.ADCSOC5CTL.bit.CHSEL= 5;       // SOC5 will convert ADCINA5

    AdcbRegs.ADCSOC0CTL.bit.CHSEL= 0;       // SOC0 will convert ADCINB0
    AdcbRegs.ADCSOC1CTL.bit.CHSEL= 1;       // SOC1 will convert ADCINB1
    AdcbRegs.ADCSOC2CTL.bit.CHSEL= 2;       // SOC2 will convert ADCINB2
    AdcbRegs.ADCSOC3CTL.bit.CHSEL= 3;       // SOC3 will convert ADCINB3


    AdccRegs.ADCSOC2CTL.bit.CHSEL= 2;       // SOC1 will convert ADCINC2
    AdccRegs.ADCSOC3CTL.bit.CHSEL= 3;       // SOC1 will convert ADCINC3
    AdccRegs.ADCSOC4CTL.bit.CHSEL= 4;       // SOC1 will convert ADCINC4
    AdccRegs.ADCSOC14CTL.bit.CHSEL= 14;     // SOC14 will convert ADCIND14
    AdccRegs.ADCSOC15CTL.bit.CHSEL= 15;       // SOC1 will convert ADCINC15

    AdcdRegs.ADCSOC0CTL.bit.CHSEL= 0;       // SOC0 will convert ADCIND0
    AdcdRegs.ADCSOC1CTL.bit.CHSEL= 1;       // SOC1 will convert ADCIND1
    AdcdRegs.ADCSOC2CTL.bit.CHSEL= 2;       // SOC2 will convert ADCIND2
    AdcdRegs.ADCSOC3CTL.bit.CHSEL= 3;       // SOC3 will convert ADCIND3
    AdcdRegs.ADCSOC4CTL.bit.CHSEL= 4;       // SOC4 will convert ADCIND4
    //AdcdRegs.ADCSOC14CTL.bit.CHSEL= 14;     // SOC14 will convert ADCIND14
    //AdcdRegs.ADCSOC15CTL.bit.CHSEL= 15;     // SOC15 will convert ADCIND15

    INT16U wTemp = 19;//14
    // SOCX will use wTemp+1 sampling duration of SYSCLK period.
    AdcaRegs.ADCSOC0CTL.bit.ACQPS   = wTemp;
    AdcaRegs.ADCSOC1CTL.bit.ACQPS   = wTemp;
    AdcaRegs.ADCSOC2CTL.bit.ACQPS   = wTemp;
    AdcaRegs.ADCSOC3CTL.bit.ACQPS   = wTemp;
    AdcaRegs.ADCSOC4CTL.bit.ACQPS   = wTemp;
    AdcaRegs.ADCSOC5CTL.bit.ACQPS   = wTemp;

    AdcbRegs.ADCSOC0CTL.bit.ACQPS   = wTemp;
    AdcbRegs.ADCSOC1CTL.bit.ACQPS   = wTemp;
    AdcbRegs.ADCSOC2CTL.bit.ACQPS   = wTemp;
    AdcbRegs.ADCSOC3CTL.bit.ACQPS   = wTemp;

    AdccRegs.ADCSOC2CTL.bit.ACQPS   = wTemp;
    AdccRegs.ADCSOC3CTL.bit.ACQPS   = wTemp;
    AdccRegs.ADCSOC4CTL.bit.ACQPS   = wTemp;
	AdccRegs.ADCSOC14CTL.bit.ACQPS   = wTemp;
	AdccRegs.ADCSOC15CTL.bit.ACQPS   = wTemp;

    AdcdRegs.ADCSOC0CTL.bit.ACQPS   = wTemp;
    AdcdRegs.ADCSOC1CTL.bit.ACQPS   = wTemp;
    AdcdRegs.ADCSOC2CTL.bit.ACQPS   = wTemp;
    AdcdRegs.ADCSOC3CTL.bit.ACQPS   = wTemp;
    AdcdRegs.ADCSOC4CTL.bit.ACQPS   = wTemp;
    //AdcdRegs.ADCSOC14CTL.bit.ACQPS   = wTemp;
    //AdcdRegs.ADCSOC15CTL.bit.ACQPS   = wTemp;

    // SOC Trigger Source Select
    INT16U wTrigSel0 = 0;//Software
    //INT16U wTrigSel1 = 0x17;//EPWM10A
    INT16U wTrigSel1 = 0x0D;//EPWM5A
    //INT16U wTrigSel1 = 0x0F;//EPWM6A
    //INT16U wTrigSel1 = 0x11;//EPWM7A
    AdcaRegs.ADCSOC0CTL.bit.TRIGSEL     = wTrigSel1;
    AdcaRegs.ADCSOC1CTL.bit.TRIGSEL     = wTrigSel1;
    AdcaRegs.ADCSOC2CTL.bit.TRIGSEL     = wTrigSel1;
    AdcaRegs.ADCSOC3CTL.bit.TRIGSEL     = wTrigSel1;
    AdcaRegs.ADCSOC4CTL.bit.TRIGSEL     = wTrigSel1;
    AdcaRegs.ADCSOC5CTL.bit.TRIGSEL     = wTrigSel1;

    AdcbRegs.ADCSOC0CTL.bit.TRIGSEL     = wTrigSel0;
    AdcbRegs.ADCSOC1CTL.bit.TRIGSEL     = wTrigSel0;
    AdcbRegs.ADCSOC2CTL.bit.TRIGSEL     = wTrigSel0;
    AdcbRegs.ADCSOC3CTL.bit.TRIGSEL     = wTrigSel0;

    AdccRegs.ADCSOC2CTL.bit.TRIGSEL     = wTrigSel0;
    AdccRegs.ADCSOC3CTL.bit.TRIGSEL     = wTrigSel0;
    AdccRegs.ADCSOC4CTL.bit.TRIGSEL     = wTrigSel0;
	AdccRegs.ADCSOC14CTL.bit.TRIGSEL     = wTrigSel0;
	AdccRegs.ADCSOC15CTL.bit.TRIGSEL     = wTrigSel0;

    AdcdRegs.ADCSOC0CTL.bit.TRIGSEL     = wTrigSel1;
    AdcdRegs.ADCSOC1CTL.bit.TRIGSEL     = wTrigSel1;
    AdcdRegs.ADCSOC2CTL.bit.TRIGSEL     = wTrigSel1;
    AdcdRegs.ADCSOC3CTL.bit.TRIGSEL     = wTrigSel1;
    AdcdRegs.ADCSOC4CTL.bit.TRIGSEL     = wTrigSel1;

    EDIS;
}
// InitGpio - Sets all pins to be muxed to GPIO in input mode.
// Also resets CPU control to CPU1 and disables open drain
// and polarity inversion and sets the qualification to synchronous.
// Also unlocks all GPIOs. Only one CPU should call this function.
void sUnlockAllGpio(void)
{
    volatile Uint32 *gpioBaseAddr;
    Uint16 regOffset;

    //
    //Disable pin locks
    //
    EALLOW;
    GpioCtrlRegs.GPALOCK.all = 0x00000000;
    GpioCtrlRegs.GPBLOCK.all = 0x00000000;
    GpioCtrlRegs.GPCLOCK.all = 0x00000000;
    GpioCtrlRegs.GPDLOCK.all = 0x00000000;
    GpioCtrlRegs.GPELOCK.all = 0x00000000;
    GpioCtrlRegs.GPFLOCK.all = 0x00000000;

    //
    //Fill all registers with zeros. Writing to each register separately
    //for six GPIO modules would make this function *very* long. Fortunately,
    //we'd be writing them all with zeros anyway, so this saves a lot of space.
    //
    gpioBaseAddr = (Uint32 *)&GpioCtrlRegs;
    for (regOffset = 0; regOffset < sizeof(GpioCtrlRegs)/2; regOffset++)
    {
        //
        //Hack to avoid enabling pull-ups on all pins. GPyPUD is offset
        //0x0C in each register group of 0x40 words. Since this is a
        //32-bit pointer, the addresses must be divided by 2.
        //
        if (regOffset % (0x40/2) != (0x0C/2))
        {
            gpioBaseAddr[regOffset] = 0x00000000;
        }
    }

    gpioBaseAddr = (Uint32 *)&GpioDataRegs;
    for (regOffset = 0; regOffset < sizeof(GpioDataRegs)/2; regOffset++)
    {
        gpioBaseAddr[regOffset] = 0x00000000;
    }

    EDIS;
}

//---------------------------------------------------------------------------
// InitGpio:
//---------------------------------------------------------------------------
// This function initializes the Gpio to a known state.
//
void sInitGpio(void)
{
    // Unlock all GPIO.
    sUnlockAllGpio();
    //Device_initGPIO();

    EALLOW;

