pwg-pwg/test/IVPMP2G2-PRO_APP/trunk/01_SourceCode/08_F2837xS_IVPMP2G2_APP/Source/APP/Initial.c
    GpioCtrlRegs.GPAPUD.bit.GPIO0 = 1;    // Disable pullup on GPIO0
    GpioCtrlRegs.GPAMUX1.bit.GPIO0 = 1;   // GPIO0 = PWM1A      //INVPWM_NU

    GpioCtrlRegs.GPAPUD.bit.GPIO1 = 1;    // Disable pullup on GPIO1
    GpioCtrlRegs.GPAMUX1.bit.GPIO1 = 1;   // GPIO1 = PWM1B      //INVPWM_ND

    GpioCtrlRegs.GPAPUD.bit.GPIO2 = 1;    // Disable pullup on GPIO2
    GpioCtrlRegs.GPAMUX1.bit.GPIO2 = 1;   // GPIO2 = PWM2A      //INVPWM_LU

    GpioCtrlRegs.GPAPUD.bit.GPIO3 = 1;    // Disable pullup on GPIO3
    GpioCtrlRegs.GPAMUX1.bit.GPIO3 = 1;   // GPIO3 = PWM2B      //INVPWM_LD

    GpioCtrlRegs.GPAPUD.bit.GPIO4 = 1;    // Disable pullup on GPIO4
    GpioCtrlRegs.GPAMUX1.bit.GPIO4 = 1;   // GPIO4 = PWM       //INVPWM_NU

    GpioCtrlRegs.GPAPUD.bit.GPIO5 = 1;    // Disable pullup on GPIO5
    GpioCtrlRegs.GPAMUX1.bit.GPIO5 = 1;   // GPIO5 = PWM      //INVPWM_ND

    GpioCtrlRegs.GPAPUD.bit.GPIO6 = 1;    // Disable pullup on GPIO6
    GpioCtrlRegs.GPAMUX1.bit.GPIO6 = 1;   // GPIO6 = PWM      //INVPWM_LU

    GpioCtrlRegs.GPAPUD.bit.GPIO7 = 1;    // Disable pullup on GPIO7
    GpioCtrlRegs.GPAMUX1.bit.GPIO7 = 1;   // GPIO7 = PWM      //INVPWM_LD

    GpioCtrlRegs.GPAPUD.bit.GPIO8 = 1;    // Disable pullup on GPIO6
    GpioCtrlRegs.GPAMUX1.bit.GPIO8 = 1;   // GPIO8 = PWM       //?Tá÷PWM

    GpioCtrlRegs.GPAPUD.bit.GPIO9 = 1;    // Disable pullup on GPIO7
    GpioCtrlRegs.GPAMUX1.bit.GPIO9 = 1;   // GPIO9 = PWM       //1y?1PWM

    GpioCtrlRegs.GPAPUD.bit.GPIO10 = 1;    // Disable pullup on GPIO10
    GpioCtrlRegs.GPAMUX1.bit.GPIO10 = 1;   // GPIO10 = PWM       //boost1

    GpioCtrlRegs.GPAPUD.bit.GPIO11 = 1;    // Disable pullup on GPIO11
    GpioCtrlRegs.GPAMUX1.bit.GPIO11 = 1;   // GPIO11 = PWM       //boost2

    GpioCtrlRegs.GPAPUD.bit.GPIO12 = 1;    // Disable pullup on GPIO12
    GpioCtrlRegs.GPAMUX1.bit.GPIO12 = 1;   // GPIO12 = PWM       //boost3
//
//    GpioCtrlRegs.GPAPUD.bit.GPIO13 = 1;    // Disable pullup on GPIO13
//    GpioCtrlRegs.GPAMUX1.bit.GPIO13 = 1;   // GPIO13 = PWM       //boost4

    GpioCtrlRegs.GPAPUD.bit.GPIO14 = 1;    // Disable pullup on GPIO14
    GpioCtrlRegs.GPAMUX1.bit.GPIO14 = 1;   // GPIO14 = PWM       //LLC H LU

    GpioCtrlRegs.GPAPUD.bit.GPIO15 = 1;    // Disable pullup on GPIO15
    GpioCtrlRegs.GPAMUX1.bit.GPIO15 = 1;   // GPIO15 = PWM       //LLC H LD

    GpioCtrlRegs.GPAPUD.bit.GPIO16 = 1;    // Disable pullup on GPIO16
    GpioCtrlRegs.GPAMUX2.bit.GPIO16 = 1;   // GPIO16 = PWM       //LLC L LU
    GpioCtrlRegs.GPAGMUX2.bit.GPIO16 = 1;   // GPIO16 = PWM       //LLC L LU

    GpioCtrlRegs.GPAPUD.bit.GPIO17 = 1;    // Disable pullup on GPIO17
    GpioCtrlRegs.GPAMUX2.bit.GPIO17 = 1;   // GPIO17 = PWM       //LLC L LD
    GpioCtrlRegs.GPAGMUX2.bit.GPIO17 = 1;   // GPIO17 = PWM       //LLC L LD

//	GpioCtrlRegs.GPAPUD.bit.GPIO18 = 1;    // Disable pullup on GPIO17
//    GpioCtrlRegs.GPAMUX2.bit.GPIO18 = 1;   // GPIO17 = PWM       //LLC L LD
//    GpioCtrlRegs.GPAGMUX2.bit.GPIO18 = 1;   // GPIO17 = PWM       //LLC L LD

//	GpioCtrlRegs.GPAPUD.bit.GPIO19 = 1;    // Disable pullup on GPIO17
//    GpioCtrlRegs.GPAMUX2.bit.GPIO19 = 1;   // GPIO17 = PWM       //LLC L LD
//    GpioCtrlRegs.GPAGMUX2.bit.GPIO19 = 1;   // GPIO17 = PWM       //LLC L LD

	//Relay Hold
    GpioCtrlRegs.GPAPUD.bit.GPIO20 = 1;  // Enable pullup on GPIO20
    GpioDataRegs.GPASET.bit.GPIO20 = 1; // Load output latch to low
    GpioCtrlRegs.GPADIR.bit.GPIO20 = 1;  // GPIO20 = output
    GpioCtrlRegs.GPAMUX2.bit.GPIO20 = 0; // GPIO20 = I/O


    GpioCtrlRegs.GPAPUD.bit.GPIO21 = 1;    // Disable pullup on GPIO21
    GpioCtrlRegs.GPAMUX2.bit.GPIO21 = 1;   // GPIO21 = PWM       //FAN PWM1
    GpioCtrlRegs.GPAGMUX2.bit.GPIO21 = 1;   // GPIO21 = PWM       //FAN PWM1

    GpioCtrlRegs.GPAPUD.bit.GPIO22 = 1;    // Disable pullup on GPIO22
    GpioCtrlRegs.GPAMUX2.bit.GPIO22 = 1;   // GPIO22 = PWM       //FAN PWM2
    GpioCtrlRegs.GPAGMUX2.bit.GPIO22 = 1;   // GPIO22 = PWM       //FAN PWM2

    GpioCtrlRegs.GPAPUD.bit.GPIO23 = 1;    // Disable pullup on GPIO23
    GpioCtrlRegs.GPAMUX2.bit.GPIO23 = 1;   // GPIO23 = PWM       //FAN PWM3
    GpioCtrlRegs.GPAGMUX2.bit.GPIO23 = 1;   // GPIO23 = PWM       //FAN PWM3

    //Fan Fault1
    GpioCtrlRegs.GPAPUD.bit.GPIO24 = 0;    // disable pullup on GPIO24
    GpioCtrlRegs.GPADIR.bit.GPIO24 = 0;
    GpioCtrlRegs.GPAQSEL2.bit.GPIO24 = 3;  // Asynch input
    GpioCtrlRegs.GPAMUX2.bit.GPIO24 = 0;   // GPIO24 = I/O

    //Fan Fault2
    GpioCtrlRegs.GPAPUD.bit.GPIO25 = 0;    // disable pullup on GPIO25
    GpioCtrlRegs.GPADIR.bit.GPIO25 = 0;
    GpioCtrlRegs.GPAQSEL2.bit.GPIO25 = 3;  // Asynch input
    GpioCtrlRegs.GPAMUX2.bit.GPIO25 = 0;   // GPIO25 = I/O

    //Fan Fault3
    GpioCtrlRegs.GPAPUD.bit.GPIO26 = 0;    // disable pullup on GPIO26
    GpioCtrlRegs.GPADIR.bit.GPIO26 = 0;
    GpioCtrlRegs.GPAQSEL2.bit.GPIO26 = 3;  // Asynch input
    GpioCtrlRegs.GPAMUX2.bit.GPIO26 = 0;   // GPIO26 = I/O

    //RUN LED  ?y3￡1s·-×a test 2s·-×a
    GpioCtrlRegs.GPAPUD.bit.GPIO27 = 1;   // disable pullup on GPIO27
    GpioDataRegs.GPACLEAR.bit.GPIO27 = 1; // Load output latch to High
    GpioCtrlRegs.GPADIR.bit.GPIO27 = 1;   // GPIO27 = output
    GpioCtrlRegs.GPAMUX2.bit.GPIO27 = 0;  // GPIO27 = output //no used

    //AC SPS
    GpioCtrlRegs.GPAPUD.bit.GPIO28 = 1;    // Disable pullup on GPIO28
    GpioDataRegs.GPACLEAR.bit.GPIO28 = 1;
    GpioCtrlRegs.GPADIR.bit.GPIO28 = 1;    // GPIO28 = output
    GpioCtrlRegs.GPAMUX2.bit.GPIO28 = 0;   // GPIO28 = I/O

    //DC SPS
    GpioCtrlRegs.GPAPUD.bit.GPIO29 = 1;    // Disable pullup on GPIO29
    GpioDataRegs.GPACLEAR.bit.GPIO29 = 1;
    GpioCtrlRegs.GPADIR.bit.GPIO29 = 1;    // GPIO29 = output
    GpioCtrlRegs.GPAMUX2.bit.GPIO29 = 0;   // GPIO29 = I/O

    //INV Fault  TZ3
    //InputXbarRegs.INPUT3SELECT = 30;       //TZ3
    GpioCtrlRegs.GPAPUD.bit.GPIO30 = 0;    // disable pullup on GPIO30
    GpioCtrlRegs.GPADIR.bit.GPIO30 = 0;
    GpioCtrlRegs.GPAQSEL2.bit.GPIO30 = 3;  // Asynch input
    GpioCtrlRegs.GPAMUX2.bit.GPIO30 = 0;
	
    //Open Loop
    GpioCtrlRegs.GPAPUD.bit.GPIO31 = 1;   // disable pullup on GPIO31
    GpioCtrlRegs.GPADIR.bit.GPIO31 = 0;
    GpioCtrlRegs.GPAQSEL2.bit.GPIO31 = 3; // Asynch input
    GpioCtrlRegs.GPAMUX2.bit.GPIO31 = 0;   // GPIO31 = I/O

    EDIS;

    EALLOW;

    //IIC_SDA
    GpioCtrlRegs.GPBPUD.bit.GPIO32 = 1;   // Disable pullup on GPIO32
    GpioDataRegs.GPBSET.bit.GPIO32 = 1;   // Load output latch to low
    GpioCtrlRegs.GPBMUX1.bit.GPIO32 = 0;  // GPIO32 = 0=GPIO,
    GpioCtrlRegs.GPBDIR.bit.GPIO32 = 1;   // GPIO32 = output

    //IIC_SCL
    GpioCtrlRegs.GPBPUD.bit.GPIO33 = 1;      // Disable pullup on
    GpioDataRegs.GPBSET.bit.GPIO33 = 1;     //  Set High initially
    GpioCtrlRegs.GPBMUX1.bit.GPIO33 = 0;    // 0=GPIO,
    GpioCtrlRegs.GPBDIR.bit.GPIO33 = 1;     // 1=OUTput,  0=INput

    //EEPROM  WP
    GpioCtrlRegs.GPBPUD.bit.GPIO34 = 1;   // Disable pullup on GPIO34
    GpioDataRegs.GPBCLEAR.bit.GPIO34 = 1; // Load output latch to low
    GpioCtrlRegs.GPBMUX1.bit.GPIO34 = 0;  // GPIO34 = I/O
    GpioCtrlRegs.GPBDIR.bit.GPIO34 = 1;   // GPIO34 = output

	//N-PE Relay
    GpioCtrlRegs.GPBPUD.bit.GPIO35 = 0;   // Enable pullup on GPIO35
    GpioDataRegs.GPBCLEAR.bit.GPIO35 = 1; // Load output latch to low
    GpioCtrlRegs.GPBDIR.bit.GPIO35 = 1;   // GPIO35 = output
    GpioCtrlRegs.GPBMUX1.bit.GPIO35 = 0;  // GPIO35 = I/O

	//BAT OVP
    GpioCtrlRegs.GPBPUD.bit.GPIO36 = 0;    // disable pullup on GPIO36
    GpioCtrlRegs.GPBDIR.bit.GPIO36 = 0;
    GpioCtrlRegs.GPBQSEL1.bit.GPIO36 = 3;  // Asynch input
    GpioCtrlRegs.GPBMUX1.bit.GPIO36 = 0;
 
