pwg-pwg/test/IVPMP2G2-PRO_APP/trunk/01_SourceCode/08_F2837xS_IVPMP2G2_APP/Source/APP/Initial.c
	//BUS OVP
    GpioCtrlRegs.GPBPUD.bit.GPIO37 = 0;    // disable pullup on GPIO37
    GpioCtrlRegs.GPBDIR.bit.GPIO37 = 0;
    GpioCtrlRegs.GPBQSEL1.bit.GPIO37 = 3;  // Asynch input
    GpioCtrlRegs.GPBMUX1.bit.GPIO37 = 0;

	//Grid L2 Relay
    GpioCtrlRegs.GPBPUD.bit.GPIO38 = 0;   // Enable pullup on GPIO38
    GpioDataRegs.GPBCLEAR.bit.GPIO38 = 1; // Load output latch to low
    GpioCtrlRegs.GPBDIR.bit.GPIO38 = 1;   // GPIO38 = output
    GpioCtrlRegs.GPBMUX1.bit.GPIO38 = 0;  // GPIO38 = I/O

	//Gen L2 Relay
    GpioCtrlRegs.GPBPUD.bit.GPIO39 = 0;   // Enable pullup on GPIO39 
    GpioDataRegs.GPBCLEAR.bit.GPIO39 = 1; // Load output latch to low
    GpioCtrlRegs.GPBDIR.bit.GPIO39 = 1;   // GPIO39  = output
    GpioCtrlRegs.GPBMUX1.bit.GPIO39 = 0;  // GPIO39  = I/O

    //PV SPS
    GpioCtrlRegs.GPBPUD.bit.GPIO40 = 1;   // Disable pullup on GPIO40
    GpioDataRegs.GPBCLEAR.bit.GPIO40 = 1; // Load output latch to low
    GpioCtrlRegs.GPBMUX1.bit.GPIO40 = 0;  // GPIO40 = I/O
    GpioCtrlRegs.GPBDIR.bit.GPIO40 = 1;   // GPIO40 = output

    //FAN Power EN
    GpioCtrlRegs.GPBPUD.bit.GPIO41 = 1;   // Disable pullup on GPIO41
    GpioDataRegs.GPBCLEAR.bit.GPIO41 = 1; // Load output latch to low
    GpioCtrlRegs.GPBMUX1.bit.GPIO41 = 0;  // GPIO41 = I/O
    GpioCtrlRegs.GPBDIR.bit.GPIO41 = 1;   // GPIO41 = output

    //SW ON
    GpioCtrlRegs.GPBPUD.bit.GPIO48 = 1;   // disable pullup on GPIO48
    GpioCtrlRegs.GPBDIR.bit.GPIO48 = 0;
    GpioCtrlRegs.GPBQSEL2.bit.GPIO48 = 3; // Asynch input
    GpioCtrlRegs.GPBMUX2.bit.GPIO48 = 0;   // GPIO48 = I/O

	 // PAR TX
    GpioCtrlRegs.GPBPUD.bit.GPIO49 = 0;  // Enable pullup on GPIO49
    GpioDataRegs.GPBCLEAR.bit.GPIO49 = 1;  // Load output latch to high
    GpioCtrlRegs.GPBDIR.bit.GPIO49 = 1;  // GPIO49 = OUTPUT
    GpioCtrlRegs.GPBMUX2.bit.GPIO49 = 0; // GPIO49 = I/O

    // PAR RX
    GpioCtrlRegs.GPBDIR.bit.GPIO50 = 0;  // ?????aê?è?
    GpioCtrlRegs.GPBPUD.bit.GPIO50 = 0;  // Enable pullup on GPIO75


	// TXD(SYN)
    GpioCtrlRegs.GPBPUD.bit.GPIO51 = 0;  // Enable pullup on GPIO51
    GpioDataRegs.GPBCLEAR.bit.GPIO51 = 1;  // Load output latch to high
    GpioCtrlRegs.GPBDIR.bit.GPIO51 = 1;  // GPIO51 = OUTPUT
    GpioCtrlRegs.GPBMUX2.bit.GPIO51 = 0; // GPIO51 = I/O

    // RXD(SYN)
    InputXbarRegs.INPUT8SELECT = 52;
    GpioCtrlRegs.GPBDIR.bit.GPIO52 = 0;  // ?????aê?è?
    GpioCtrlRegs.GPBPUD.bit.GPIO52 = 0;  // Enable pullup on GPIO52
    GpioCtrlRegs.GPBQSEL2.bit.GPIO52 = 3;//?????a·?í?2??￡ê?

	// TXD(HOST)
	GpioCtrlRegs.GPBPUD.bit.GPIO53 = 0;  // Enable pullup on GPIO53
	GpioDataRegs.GPBCLEAR.bit.GPIO53= 1; // Load output latch to low
	GpioCtrlRegs.GPBMUX2.bit.GPIO53 = 0; // GPIO53 = I/O
	GpioCtrlRegs.GPBDIR.bit.GPIO53 = 1;  // GPIO53 = output

	//RXD(HOST)
	GpioCtrlRegs.GPBPUD.bit.GPIO54 = 0;  // Enable pullup on
	GpioCtrlRegs.GPBMUX2.bit.GPIO54 = 0; // GPIO54 = I/O
	GpioCtrlRegs.GPBDIR.bit.GPIO54 = 0;  // GPIO54 = INput

    //PV BUS OVP
    GpioCtrlRegs.GPBPUD.bit.GPIO59 = 1;   // disable pullup on GPIO59
    GpioCtrlRegs.GPBDIR.bit.GPIO59 = 0;
    GpioCtrlRegs.GPBQSEL2.bit.GPIO59 = 3; // Asynch input
    GpioCtrlRegs.GPBMUX2.bit.GPIO59 = 0;   // GPIO59 = I/O
	
	//GridN Relay
    GpioCtrlRegs.GPBPUD.bit.GPIO60 = 0;   // Enable pullup on GPIO60
    GpioDataRegs.GPBCLEAR.bit.GPIO60 = 1; // Load output latch to low
    GpioCtrlRegs.GPBDIR.bit.GPIO60 = 1;   // GPIO60 = output
    GpioCtrlRegs.GPBMUX2.bit.GPIO60 = 0;  // GPIO60 = I/O

	//InvN Relay
    GpioCtrlRegs.GPBPUD.bit.GPIO61 = 0;   // Enable pullup on GPIO61
    GpioDataRegs.GPBCLEAR.bit.GPIO61 = 1; // Load output latch to low
    GpioCtrlRegs.GPBDIR.bit.GPIO61 = 1;   // GPIO61 = output
    GpioCtrlRegs.GPBMUX2.bit.GPIO61 = 0;  // GPIO61 = I/O

    //GenL1 Relay
    GpioCtrlRegs.GPBPUD.bit.GPIO62 = 0;   // Enable pullup on GPIO62
    GpioDataRegs.GPBCLEAR.bit.GPIO62 = 1; // Load output latch to low
    GpioCtrlRegs.GPBDIR.bit.GPIO62 = 1;   // GPIO62 = output
    GpioCtrlRegs.GPBMUX2.bit.GPIO62 = 0;  // GPIO62 = I/O

    //GridL1 Relay
    GpioCtrlRegs.GPBPUD.bit.GPIO63 = 0;   // Enable pullup on GPIO63
    GpioDataRegs.GPBCLEAR.bit.GPIO63 = 1; // Load output latch to low
    GpioCtrlRegs.GPBDIR.bit.GPIO63 = 1;   // GPIO63 = output
    GpioCtrlRegs.GPBMUX2.bit.GPIO63 = 0;  // GPIO63 = I/O

    EDIS;

    EALLOW;

    //INV1 Relay
    GpioCtrlRegs.GPCPUD.bit.GPIO64 = 0;   // Enable pullup on GPIO64
    GpioDataRegs.GPCCLEAR.bit.GPIO64 = 1; // Load output latch to low
    GpioCtrlRegs.GPCDIR.bit.GPIO64 = 1;   // GPIO64 = output
    GpioCtrlRegs.GPCMUX1.bit.GPIO64 = 0;  // GPIO64 = I/O

    //INV2 Relay
    GpioCtrlRegs.GPCPUD.bit.GPIO65 = 0;   // Enable pullup on GPIO65
    GpioDataRegs.GPCCLEAR.bit.GPIO65 = 1; // Load output latch to low
    GpioCtrlRegs.GPCDIR.bit.GPIO65 = 1;   // GPIO65 = output
    GpioCtrlRegs.GPCMUX1.bit.GPIO65 = 0;  // GPIO65 = I/O

     // CAN(SYNC)RX ?′ó?5
    GpioCtrlRegs.GPCPUD.bit.GPIO70 = 0;     // Enable pull-up for GPIO70
    GpioCtrlRegs.GPCQSEL1.bit.GPIO70 = 3;   // Asynch qual for GPIO70 (CANRXA)
    GpioCtrlRegs.GPCMUX1.bit.GPIO70 = 1;    // Configure GPIO70 for CANRXA operation
    GpioCtrlRegs.GPCGMUX1.bit.GPIO70 = 1;   // Configure GPIO70 for CANRXA operation

    // CAN(SYNC)TX
    GpioCtrlRegs.GPCPUD.bit.GPIO71 = 0;     // Enable pull-up for GPIO71
    GpioCtrlRegs.GPCMUX1.bit.GPIO71 = 1;    // Configure GPIO71 for CANTXA operation
    GpioCtrlRegs.GPCGMUX1.bit.GPIO71 = 1;   // Configure GPIO71 for CANTXA operation

	//12V Fault
    GpioCtrlRegs.GPCPUD.bit.GPIO76 = 0;    // disable pullup on GPIO76
    GpioCtrlRegs.GPCDIR.bit.GPIO76 = 0;
    GpioCtrlRegs.GPCQSEL1.bit.GPIO76 = 3;  // Asynch input
    GpioCtrlRegs.GPCMUX1.bit.GPIO76 = 0;

    //5V Fault
    GpioCtrlRegs.GPCPUD.bit.GPIO77 = 0;    // disable pullup on GPIO77
    GpioCtrlRegs.GPCDIR.bit.GPIO77 = 0;
    GpioCtrlRegs.GPCQSEL1.bit.GPIO77 = 3;  // Asynch input
    GpioCtrlRegs.GPCMUX1.bit.GPIO77 = 0;

    /*GPIO_TEST*/
    // GpioCtrlRegs.GPCPUD.bit.GPIO66 = 0;    // disable pullup on GPIO66
    // GpioDataRegs.GPCCLEAR.bit.GPIO66 = 1;
    // GpioCtrlRegs.GPCDIR.bit.GPIO66 = 1;
    // GpioCtrlRegs.GPCMUX1.bit.GPIO66 = 0;


