pwg-pwg/test/IVPMP2G2-PRO_APP/trunk/01_SourceCode/08_F2837xS_IVPMP2G2_APP/Source/APP/Initial.c
	//PV1 OCP
    GpioCtrlRegs.GPCPUD.bit.GPIO78 = 1;   // disable pullup on GPIO78
    GpioCtrlRegs.GPCDIR.bit.GPIO78 = 0;
    GpioCtrlRegs.GPCQSEL1.bit.GPIO78 = 3; // Asynch input
    GpioCtrlRegs.GPCMUX1.bit.GPIO78 = 0;   // GPIO78 = I/O

    //PV2 OCP
    GpioCtrlRegs.GPCPUD.bit.GPIO79 = 1;   // disable pullup on GPIO79
    GpioCtrlRegs.GPCDIR.bit.GPIO79 = 0;
    GpioCtrlRegs.GPCQSEL1.bit.GPIO79 = 3; // Asynch input
    GpioCtrlRegs.GPCMUX1.bit.GPIO79 = 0;   // GPIO79 = I/O

	//4051 S1
	GpioCtrlRegs.GPCPUD.bit.GPIO80 = 0;  // Enable pullup on GPIO80
	GpioDataRegs.GPCCLEAR.bit.GPIO80= 1; // Load output latch to low
	GpioCtrlRegs.GPCMUX2.bit.GPIO80 = 0; // GPIO80 = I/O
	GpioCtrlRegs.GPCDIR.bit.GPIO80 = 1;  // GPIO80 = output

	//4051 S2
	GpioCtrlRegs.GPCPUD.bit.GPIO81 = 0;  // Enable pullup on GPIO81
	GpioDataRegs.GPCCLEAR.bit.GPIO81= 1; // Load output latch to low
	GpioCtrlRegs.GPCMUX2.bit.GPIO81 = 0; // GPIO81 = I/O
	GpioCtrlRegs.GPCDIR.bit.GPIO81 = 1;  // GPIO81 = output

	//4051 S3
	GpioCtrlRegs.GPCPUD.bit.GPIO82 = 0;  // Enable pullup on GPIO82
	GpioDataRegs.GPCCLEAR.bit.GPIO82= 1; // Load output latch to low
	GpioCtrlRegs.GPCMUX2.bit.GPIO82 = 0; // GPIO82 = I/O
	GpioCtrlRegs.GPCDIR.bit.GPIO82 = 1;  // GPIO82 = output

     //?á??í¨??TX SCIB
    GpioCtrlRegs.GPCPUD.bit.GPIO86 = 0;   // Enable pullup on GPIO86
    GpioCtrlRegs.GPCMUX2.bit.GPIO86 = 1;  // GPIO86 = SCITXDA
    GpioCtrlRegs.GPCGMUX2.bit.GPIO86 = 1; // GPIO86 = SCITXDA

    //?á??í¨??RX SCIB
    GpioCtrlRegs.GPCPUD.bit.GPIO87 = 0;   // Enable pullup on GPIO87
    GpioCtrlRegs.GPCQSEL2.bit.GPIO87 = 3; // Asynch input
    GpioCtrlRegs.GPCMUX2.bit.GPIO87 = 1;  // GPIO87 = SCIRXDA
    GpioCtrlRegs.GPCGMUX2.bit.GPIO87 = 1; // GPIO87 = SCIRXDA

    //é????úí¨??TX SCIC
    GpioCtrlRegs.GPCPUD.bit.GPIO89 = 0;   // Enable pullup on GPIO89
    GpioCtrlRegs.GPCMUX2.bit.GPIO89 = 2;  // GPIO89 = SCITXDA
    GpioCtrlRegs.GPCGMUX2.bit.GPIO89 = 1; // GPIO89 = SCITXDA

    //é????úí¨??RX SCIC
    GpioCtrlRegs.GPCPUD.bit.GPIO90 = 0;   // Enable pullup on GPIO90
    GpioCtrlRegs.GPCQSEL2.bit.GPIO90 = 3; // Asynch input
    GpioCtrlRegs.GPCMUX2.bit.GPIO90 = 2;  // GPIO90 = SCIRXDA
    GpioCtrlRegs.GPCGMUX2.bit.GPIO90 = 1; // GPIO90 = SCIRXDA


	//RLY ISO+
    GpioCtrlRegs.GPCPUD.bit.GPIO91 = 1;   // Disable pullup on GPIO42
    GpioDataRegs.GPCCLEAR.bit.GPIO91 = 1; // Load output latch to low
    GpioCtrlRegs.GPCMUX2.bit.GPIO91 = 0;  // GPIO42 = I/O
    GpioCtrlRegs.GPCDIR.bit.GPIO91 = 1;   // GPIO42 = output

    //RLY ISO-
    GpioCtrlRegs.GPCPUD.bit.GPIO92 = 1;   // Disable pullup on GPIO43
    GpioDataRegs.GPCCLEAR.bit.GPIO92 = 1; // Load output latch to low
    GpioCtrlRegs.GPCMUX2.bit.GPIO92 = 0;  // GPIO43 = I/O
    GpioCtrlRegs.GPCDIR.bit.GPIO92 = 1;   // GPIO43 = output

	//Wire.Detect
    GpioCtrlRegs.GPCPUD.bit.GPIO94 = 0;    // disable pullup on GPIO94
    GpioCtrlRegs.GPCDIR.bit.GPIO94 = 0;
    GpioCtrlRegs.GPCQSEL2.bit.GPIO94 = 3;  // Asynch input
    GpioCtrlRegs.GPCMUX2.bit.GPIO94 = 0;

	//LLC OCP
    GpioCtrlRegs.GPDPUD.bit.GPIO99 = 0;    // disable pullup on GPIO99
    GpioCtrlRegs.GPDDIR.bit.GPIO99 = 0;
    GpioCtrlRegs.GPDQSEL1.bit.GPIO99 = 3;  // Asynch input
    GpioCtrlRegs.GPDMUX1.bit.GPIO99 = 0;

    EDIS;
}

//---------------------------------------------------------------------------
//sInitEpwm:
//---------------------------------------------------------------------------
//This function initializes the Evernt manager register

void sInitEpwm(void)
{
	INT16U wLLCPwmPeriod = cLLC_PWM_PERIOD_28KHz;
	
	if(g_wVAType == cb8000VAModel)
	{
		wLLCPwmPeriod = cLLC_PWM_PERIOD_32KHz;
	}
	else if((g_wVAType == cb10KVAModel)||(g_wVAType == cb12KVAModel))
	{
		wLLCPwmPeriod = cLLC_PWM_PERIOD_28KHz;
	}
    EALLOW;
    CpuSysRegs.PCLKCR0.bit.TBCLKSYNC = 0;      // Stop all the TB clocks
    EDIS;

    //INV               
    EALLOW;
//    EPwm1Regs.TZSEL.bit.OSHT1 = 1;
//    EPwm1Regs.TZSEL.bit.OSHT2 = 1;
    EPwm1Regs.TZFRC.bit.OST  = 1;
    EPwm1Regs.TZCTL.bit.TZA = TZ_FORCE_LO;  //force low
    EPwm1Regs.TZCTL.bit.TZB = TZ_FORCE_LO;  //force low
    EPwm1Regs.TZCLR.bit.OST=1;
    EPwm1Regs.AQSFRC.bit.RLDCSF = 3;
    EDIS;

    EPwm1Regs.AQCSFRC.all = 0x5; // CSFA = 1, CSFB = 1;
    EPwm1Regs.TBPRD = cINV_PWM_PERIOD; // Period = 5200 TBCLK counts
    EPwm1Regs.TBPHS.bit.TBPHS = 2; // Set Phase register to zero
    EPwm1Regs.TBCTR = 0x0000;       // Clear counter
    EPwm1Regs.TBCTL.bit.CLKDIV = CHP_DIV1; // TBCLK = SYSCLKOUT / (HSPCLKDIV*CLKDIV)
    EPwm1Regs.TBCTL.bit.HSPCLKDIV = CHP_DIV1;//=100M/(1*1)
    EPwm1Regs.TBCTL.bit.CTRMODE = TB_COUNT_UPDOWN; // up-down mode
    EPwm1Regs.TBCTL.bit.PHSEN = TB_DISABLE; //Do not load the time-base counter (TBCTR) from the time-base phase register (TBPHS)
    EPwm1Regs.TBCTL.bit.PRDLD = TB_SHADOW;  //loaded the TBPRD from shadow register when TBCTR is equal to zero
    EPwm1Regs.TBCTL.bit.SYNCOSEL = TB_CTR_ZERO;
    EPwm1Regs.TBCTL.bit.SWFSYNC = 0;
    EPwm1Regs.TBCTL.bit.PHSDIR = 1;//Count up after the synchronization event
    EPwm1Regs.CMPCTL.bit.SHDWAMODE = CC_SHADOW;  //load CMPA from shadow register
    EPwm1Regs.CMPCTL.bit.LOADAMODE = CC_CTR_ZERO;  //load CMPA on CTR=0
    EPwm1Regs.CMPCTL.bit.SHDWBMODE = CC_SHADOW;
    EPwm1Regs.CMPCTL.bit.LOADBMODE = CC_CTR_ZERO;
    EPwm1Regs.AQCTLA.all = 0x0555;          //EPWM1A always low,modify it when  control start
    EPwm1Regs.AQCTLB.all = 0x0555;          //EPWM1B always low
    EPwm1Regs.CMPA.bit.CMPA = 0xFFFF;
    EPwm1Regs.CMPB.bit.CMPB = 0xFFFF;

    EPwm1Regs.ETPS.bit.INTCNT = 0;
    EPwm1Regs.ETPS.bit.INTPRD = ET_1ST;         //first envent trigger
    EPwm1Regs.ETSEL.bit.INTEN = PWM1_INT_ENABLE;  //enable PWM int
    EPwm1Regs.ETSEL.bit.INTSEL = ET_CTR_PRD;    //Enable event time-base counter equal to period
    EPwm1Regs.ETCLR.bit.INT = 1;    //Clears the ETFLG[INT] flag bit

    //INV	 
    EALLOW;
//    EPwm2Regs.TZSEL.bit.OSHT1 = 1;
//    EPwm2Regs.TZSEL.bit.OSHT2 = 1;
    EPwm2Regs.TZFRC.bit.OST  = 1;
    EPwm2Regs.TZCTL.bit.TZA = TZ_FORCE_LO;  //force low
    EPwm2Regs.TZCTL.bit.TZB = TZ_FORCE_LO;  //force low
    EPwm2Regs.TZCLR.bit.OST=1;
    EPwm2Regs.AQSFRC.bit.RLDCSF = 3;
    EDIS;
	EPwm2Regs.AQCSFRC.all = 0x5; // CSFA = 1, CSFB = 1;
    EPwm2Regs.TBPRD = cINV_PWM_PERIOD; // Period = 5200 TBCLK counts
    EPwm2Regs.TBPHS.bit.TBPHS = 2; // Set Phase register to zero
    EPwm2Regs.TBCTR = 0x0000;       // Clear counter
    EPwm2Regs.TBCTL.bit.CLKDIV = CHP_DIV1; // TBCLK = SYSCLKOUT / (HSPCLKDIV*CLKDIV)
    EPwm2Regs.TBCTL.bit.HSPCLKDIV = CHP_DIV1;//=100M/(1*1)
    EPwm2Regs.TBCTL.bit.CTRMODE = TB_COUNT_UPDOWN; // up-down mode
    EPwm2Regs.TBCTL.bit.PHSEN = TB_ENABLE; //Do not load the time-base counter (TBCTR) from the time-base phase register (TBPHS)
    EPwm2Regs.TBCTL.bit.PRDLD = TB_SHADOW;  //loaded the TBPRD from shadow register when TBCTR is equal to zero
    EPwm2Regs.TBCTL.bit.SYNCOSEL = TB_SYNC_IN;
    EPwm2Regs.TBCTL.bit.SWFSYNC = 0;
    EPwm2Regs.TBCTL.bit.PHSDIR = 1;//Count up after the synchronization event
    EPwm2Regs.CMPCTL.bit.SHDWAMODE = CC_SHADOW;  //load CMPA from shadow register
    EPwm2Regs.CMPCTL.bit.LOADAMODE = CC_CTR_ZERO;  //load CMPA on CTR=0
    EPwm2Regs.CMPCTL.bit.SHDWBMODE = CC_SHADOW;
    EPwm2Regs.CMPCTL.bit.LOADBMODE = CC_CTR_ZERO;
    EPwm2Regs.AQCTLA.all = 0x0555;          //EPWM1A always low,modify it when  control start
    EPwm2Regs.AQCTLB.all = 0x0555;          //EPWM1B always low
    EPwm2Regs.CMPA.bit.CMPA = 0xFFFF;
    EPwm2Regs.CMPB.bit.CMPB = 0xFFFF;

    EPwm2Regs.ETPS.bit.INTCNT = 0;
    EPwm2Regs.ETPS.bit.INTPRD = ET_1ST;         //first envent trigger
    EPwm2Regs.ETSEL.bit.INTEN = 1;  //enable PWM int
    EPwm2Regs.ETSEL.bit.INTSEL = ET_CTR_ZERO; //Enable event time-base counter equal to zero.
    EPwm2Regs.ETCLR.bit.INT = 1;    //Clears the ETFLG[INT] flag bit

	//INV	 
    EALLOW;
//    EPwm3Regs.TZSEL.bit.OSHT1 = 1;
//    EPwm3Regs.TZSEL.bit.OSHT2 = 1;
    EPwm3Regs.TZFRC.bit.OST  = 1;
    EPwm3Regs.TZCTL.bit.TZA = TZ_FORCE_LO;  //force low
    EPwm3Regs.TZCTL.bit.TZB = TZ_FORCE_LO;  //force low
    EPwm3Regs.TZCLR.bit.OST=1;
    EPwm3Regs.AQSFRC.bit.RLDCSF = 3;
    EDIS;
	EPwm3Regs.AQCSFRC.all = 0x5; // CSFA = 1, CSFB = 1;
    EPwm3Regs.TBPRD = cINV_PWM_PERIOD; // Period = 5200 TBCLK counts
    EPwm3Regs.TBPHS.bit.TBPHS = 2; // Set Phase register to zero
    EPwm3Regs.TBCTR = 0x0000;       // Clear counter
    EPwm3Regs.TBCTL.bit.CLKDIV = CHP_DIV1; // TBCLK = SYSCLKOUT / (HSPCLKDIV*CLKDIV)
    EPwm3Regs.TBCTL.bit.HSPCLKDIV = CHP_DIV1;//=100M/(1*1)
    EPwm3Regs.TBCTL.bit.CTRMODE = TB_COUNT_UPDOWN; // up-down mode
    EPwm3Regs.TBCTL.bit.PHSEN = TB_ENABLE; //Do not load the time-base counter (TBCTR) from the time-base phase register (TBPHS)
    EPwm3Regs.TBCTL.bit.PRDLD = TB_SHADOW;  //loaded the TBPRD from shadow register when TBCTR is equal to zero
    EPwm3Regs.TBCTL.bit.SYNCOSEL = TB_SYNC_IN;
    EPwm3Regs.TBCTL.bit.PHSDIR = 1;//Count up after the synchronization event

