pwg-pwg/test/IVPMP2G2-PRO_APP/trunk/01_SourceCode/08_F2837xS_IVPMP2G2_APP/Source/APP/Initial.c
    EPwm3Regs.CMPCTL.bit.SHDWAMODE = CC_SHADOW;  //load CMPA from shadow register
    EPwm3Regs.CMPCTL.bit.LOADAMODE = CC_CTR_ZERO;  //load CMPA on CTR=0
    EPwm3Regs.CMPCTL.bit.SHDWBMODE = CC_SHADOW;
    EPwm3Regs.CMPCTL.bit.LOADBMODE = CC_CTR_ZERO;
    EPwm3Regs.AQCTLA.all = 0x0555;          //EPWM1A always low,modify it when  control start
    EPwm3Regs.AQCTLB.all = 0x0555;          //EPWM1B always low
    EPwm3Regs.CMPA.bit.CMPA = 0xFFFF;
    EPwm3Regs.CMPB.bit.CMPB = 0xFFFF;
	
    EPwm3Regs.ETPS.bit.INTCNT = 0;
    EPwm3Regs.ETPS.bit.INTPRD = ET_1ST;         //first envent trigger
    EPwm3Regs.ETSEL.bit.INTEN = 0;  //enable PWM int
    EPwm3Regs.ETSEL.bit.INTSEL = ET_CTR_PRD;    //Enable event time-base counter equal to period
    EPwm3Regs.ETCLR.bit.INT = 1;    //Clears the ETFLG[INT] flag bit

	//INV	 
    EALLOW;
//    EPwm4Regs.TZSEL.bit.OSHT1 = 1;
//    EPwm4Regs.TZSEL.bit.OSHT2 = 1;
    EPwm4Regs.TZFRC.bit.OST  = 1;
    EPwm4Regs.TZCTL.bit.TZA = TZ_FORCE_LO;  //force low
    EPwm4Regs.TZCTL.bit.TZB = TZ_FORCE_LO;  //force low
    EPwm4Regs.TZCLR.bit.OST=1;
    EPwm4Regs.AQSFRC.bit.RLDCSF = 3;
    EDIS;
	EPwm4Regs.AQCSFRC.all = 0x5; // CSFA = 1, CSFB = 1;
    EPwm4Regs.TBPRD = cINV_PWM_PERIOD; // Period = 5200 TBCLK counts
    EPwm4Regs.TBPHS.bit.TBPHS = 2; // Set Phase register to zero
    EPwm4Regs.TBCTR = 0x0000;       // Clear counter
    EPwm4Regs.TBCTL.bit.CLKDIV = CHP_DIV1; // TBCLK = SYSCLKOUT / (HSPCLKDIV*CLKDIV)
    EPwm4Regs.TBCTL.bit.HSPCLKDIV = CHP_DIV1;//=100M/(1*1)
    EPwm4Regs.TBCTL.bit.CTRMODE = TB_COUNT_UPDOWN; // up-down mode
    EPwm4Regs.TBCTL.bit.PHSEN = TB_ENABLE; //Do not load the time-base counter (TBCTR) from the time-base phase register (TBPHS)
    EPwm4Regs.TBCTL.bit.PRDLD = TB_SHADOW;  //loaded the TBPRD from shadow register when TBCTR is equal to zero
    EPwm4Regs.TBCTL.bit.SYNCOSEL = TB_SYNC_IN;
    EPwm4Regs.TBCTL.bit.PHSDIR = 1;//Count up after the synchronization event

    EPwm4Regs.CMPCTL.bit.SHDWAMODE = CC_SHADOW;  //load CMPA from shadow register
    EPwm4Regs.CMPCTL.bit.LOADAMODE = CC_CTR_ZERO;  //load CMPA on CTR=0
    EPwm4Regs.CMPCTL.bit.SHDWBMODE = CC_SHADOW;
    EPwm4Regs.CMPCTL.bit.LOADBMODE = CC_CTR_ZERO;
    EPwm4Regs.AQCTLA.all = 0x0555;          //EPWM1A always low,modify it when  control start
    EPwm4Regs.AQCTLB.all = 0x0555;          //EPWM1B always low
    EPwm4Regs.CMPA.bit.CMPA = 0xFFFF;
    EPwm4Regs.CMPB.bit.CMPB = 0xFFFF;

    EPwm4Regs.ETPS.bit.INTCNT = 0;
    EPwm4Regs.ETPS.bit.INTPRD = ET_1ST;         //first envent trigger
    EPwm4Regs.ETSEL.bit.INTEN = 0;  //enable PWM int
    EPwm4Regs.ETSEL.bit.INTSEL = ET_CTR_PRD;    //Enable event time-base counter equal to period
    EPwm4Regs.ETCLR.bit.INT = 1;    //Clears the ETFLG[INT] flag bi

	    //BOOST 1 2
    EALLOW;
//    EPwm5Regs.TZCTL.bit.TZA = TZ_FORCE_LO;  //force low
//    EPwm5Regs.TZCTL.bit.TZB = TZ_FORCE_LO;  //force low
    EPwm5Regs.AQSFRC.bit.RLDCSF = 1;
    EDIS;
	EPwm5Regs.AQCSFRC.all = 0x5; // CSFA = 1, CSFB = 1;
    EPwm5Regs.TBPRD = cBOOST_PWM_PERIOD; // Period = 5200 TBCLK counts
    EPwm5Regs.TBPHS.bit.TBPHS = 2; // Set Phase register to zero
    EPwm5Regs.TBCTR = 0x0000;       // Clear counter
    //EPwm6Regs.TBCTR = 300;       // Clear counter
    EPwm5Regs.TBCTL.bit.CLKDIV = CHP_DIV1; // TBCLK = SYSCLKOUT / (HSPCLKDIV*CLKDIV)
    EPwm5Regs.TBCTL.bit.HSPCLKDIV = CHP_DIV1;//=100M/(1*1)
    EPwm5Regs.TBCTL.bit.CTRMODE = TB_COUNT_UPDOWN; // up-down mode
    EPwm5Regs.TBCTL.bit.PHSEN = TB_DISABLE; //Do not load the time-base counter (TBCTR) from the time-base phase register (TBPHS)
    EPwm5Regs.TBCTL.bit.PRDLD = TB_SHADOW;  //loaded the TBPRD from shadow register when TBCTR is equal to zero

    EPwm5Regs.TBCTL.bit.SYNCOSEL = TB_SYNC_DISABLE;
    EPwm5Regs.TBCTL.bit.PHSDIR = TB_UP;//Count up after the synchronization event

    EPwm5Regs.CMPCTL.bit.SHDWAMODE = CC_SHADOW;  //load CMPA from shadow register
    EPwm5Regs.CMPCTL.bit.LOADAMODE = CC_CTR_PRD;  //load CMPA on CTR=0
    EPwm5Regs.CMPCTL.bit.SHDWBMODE = CC_SHADOW;
    EPwm5Regs.CMPCTL.bit.LOADBMODE = CC_CTR_PRD;
    EPwm5Regs.AQCTLA.all = 0;
	EPwm5Regs.AQCTLA.bit.CAU = AQ_CLEAR;
	EPwm5Regs.AQCTLA.bit.CAD = AQ_SET;	
	EPwm5Regs.CMPA.bit.CMPA = 0;
	
	EPwm5Regs.AQCTLB.all = 0;
//	EPwm5Regs.AQCTLB.bit.CBU = AQ_CLEAR;
//	EPwm5Regs.AQCTLB.bit.CBD = AQ_SET;	
	EPwm5Regs.AQCTLB.bit.CBU = AQ_SET;
	EPwm5Regs.AQCTLB.bit.CBD = AQ_CLEAR;
	EPwm5Regs.CMPB.bit.CMPB = 0;

    EPwm5Regs.DBCTL.bit.OUT_MODE = DB_DISABLE; //disable DB first,enable it  when control start
    EPwm5Regs.DBCTL.bit.POLSEL = DB_ACTV_HIC; // Active Hi complementary
    EPwm5Regs.DBFED.bit.DBFED = 240;//SCCM 96 cBUCKPeriod*2/100*4   0.8us
    EPwm5Regs.DBRED.bit.DBRED = 240;

    EPwm5Regs.ETPS.bit.INTCNT = 0;
    EPwm5Regs.ETPS.bit.INTPRD = ET_1ST;         //first envent trigger
    EPwm5Regs.ETSEL.bit.INTEN = 0;  //enable PWM int
    EPwm5Regs.ETSEL.bit.INTSEL = ET_CTR_PRD;    //Enable event time-base counter equal to period
    EPwm5Regs.ETCLR.bit.INT = 1;    //Clears the ETFLG[INT] flag bit

	EPwm5Regs.ETSEL.bit.SOCAEN = 0;     // Disable SOC on A group
    EPwm5Regs.ETSEL.bit.SOCASEL = 3;    // Select SOC on zero or period
    EPwm5Regs.ETPS.bit.SOCAPRD = 1;     // Generate pulse on 1st event
    EPwm5Regs.ETSEL.bit.SOCAEN = 1;     // Enable SOCA

	//	 //EPWM6
//    EALLOW;
//    //EPwm6Regs.TZCTL.bit.TZA = TZ_FORCE_LO;  //force low
//    //EPwm6Regs.TZCTL.bit.TZB = TZ_FORCE_LO;  //force low
//    EPwm6Regs.AQSFRC.bit.RLDCSF = 1;
//    EDIS;
//	EPwm6Regs.AQCSFRC.all = 0x5; // CSFA = 1, CSFB = 1;
//    EPwm6Regs.TBPRD = cBOOST_PWM_PERIOD; // Period = 5200 TBCLK counts
//    EPwm6Regs.TBPHS.bit.TBPHS = 0; // Set Phase register to zero
//    EPwm6Regs.TBCTR = 0x0000;       // Clear counter
//    EPwm6Regs.TBCTL.bit.CLKDIV = CHP_DIV1; // TBCLK = SYSCLKOUT / (HSPCLKDIV*CLKDIV)
//    EPwm6Regs.TBCTL.bit.HSPCLKDIV = CHP_DIV1;//=100M/(1*1)
//    EPwm6Regs.TBCTL.bit.CTRMODE = TB_COUNT_UPDOWN; // up-down mode
//    EPwm6Regs.TBCTL.bit.PHSEN = TB_ENABLE; //Do not load the time-base counter (TBCTR) from the time-base phase register (TBPHS)
//    EPwm6Regs.TBCTL.bit.PRDLD = TB_SHADOW;  //loaded the TBPRD from shadow register when TBCTR is equal to zero

//    EPwm6Regs.TBCTL.bit.SYNCOSEL = TB_SYNC_IN;
//    EPwm6Regs.TBCTL.bit.PHSDIR = TB_UP;//Count up after the synchronization event 0:down 1:up

//    EPwm6Regs.CMPCTL.bit.SHDWAMODE = CC_SHADOW;  //load CMPA from shadow register
//    EPwm6Regs.CMPCTL.bit.LOADAMODE = CC_CTR_PRD;  //load CMPA on CTR=0
//    EPwm6Regs.CMPCTL.bit.SHDWBMODE = CC_SHADOW;
//    EPwm6Regs.CMPCTL.bit.LOADBMODE = CC_CTR_PRD;
//    EPwm6Regs.AQCTLA.all = 0;
//	EPwm6Regs.AQCTLA.bit.CAU = AQ_CLEAR;
//	EPwm6Regs.AQCTLA.bit.CAD = AQ_SET;	
//	EPwm6Regs.CMPA.bit.CMPA = 0;
//	
//	EPwm6Regs.AQCTLB.all = 0;
//	EPwm6Regs.AQCTLB.bit.CBU = AQ_CLEAR;
//	EPwm6Regs.AQCTLB.bit.CBD = AQ_SET;	
//	EPwm6Regs.CMPB.bit.CMPB = 0;

//    EPwm6Regs.DBCTL.bit.OUT_MODE = DB_DISABLE; //disable DB first,enable it  when control start
//    EPwm6Regs.DBCTL.bit.POLSEL = DB_ACTV_HIC; // Active Hi complementary
//    EPwm6Regs.DBFED.bit.DBFED = 240;//SCCM 96 cBUCKPeriod*2/100*4   0.8us
//    EPwm6Regs.DBRED.bit.DBRED = 240;

//    EPwm6Regs.ETPS.bit.INTCNT = 0;
//    EPwm6Regs.ETPS.bit.INTPRD = ET_1ST;         //first envent trigger
//    EPwm6Regs.ETSEL.bit.INTEN = 0;  //enable PWM int
//    EPwm6Regs.ETSEL.bit.INTSEL = ET_CTR_PRD;    //Enable event time-base counter equal to period
//    EPwm6Regs.ETCLR.bit.INT = 1;    //Clears the ETFLG[INT] flag bit

//	EPwm6Regs.ETSEL.bit.SOCAEN = 0;     // Disable SOC on A group
//    EPwm6Regs.ETSEL.bit.SOCASEL = 3;    // Select SOC on zero or period 3
//    EPwm6Regs.ETPS.bit.SOCAPRD = 1;     // Generate pulse on 1st event
//    EPwm6Regs.ETSEL.bit.SOCAEN = 1;     // Enable SOCA

	//保护 PWM 
	EPwm7Regs.TZCLR.bit.OST=1;
	EPwm7Regs.AQSFRC.bit.RLDCSF = 3;
	EPwm7Regs.AQCSFRC.all = 0x5; // CSFA = 1, CSFB = 1;
	EPwm7Regs.AQCSFRC.bit.CSFA = 0x0; // CSFA = 0, CSFB = 1;
	EPwm7Regs.TBPRD = 1667;		// Protect	PWM ,20KHz
	EPwm7Regs.TBPHS.bit.TBPHS = 0;	   // Set Phase register to zero
	EPwm7Regs.TBCTR = 0x0000;			   // Clear counter
	EPwm7Regs.TBCTL.bit.CLKDIV = CHP_DIV1;  // TBCLK = SYSCLKOUT / (HSPCLKDIV*CLKDIV)
	EPwm7Regs.TBCTL.bit.HSPCLKDIV = CHP_DIV1;//=100M/(1*1)
	EPwm7Regs.TBCTL.bit.CTRMODE = TB_COUNT_UPDOWN; // up down mode
	EPwm7Regs.TBCTL.bit.PHSEN = TB_DISABLE; //Do not load the time-base counter (TBCTR) from the time-base phase register (TBPHS)
	EPwm7Regs.TBCTL.bit.PRDLD = TB_SHADOW;  //loaded from shadow register when TBCTR is equal to zero
	EPwm7Regs.TBCTL.bit.SYNCOSEL = TB_CTR_ZERO;

