pwg-pwg/test/IVPMP2G2-PRO_APP/trunk/01_SourceCode/08_F2837xS_IVPMP2G2_APP/Source/APP/Initial.c
	EPwm7Regs.CMPCTL.bit.SHDWAMODE = CC_SHADOW;
	EPwm7Regs.CMPCTL.bit.LOADAMODE = CC_CTR_PRD;
	EPwm7Regs.CMPCTL.bit.SHDWBMODE = CC_SHADOW;
	EPwm7Regs.CMPCTL.bit.LOADBMODE = CC_CTR_PRD;

	EPwm7Regs.AQCTLA.all = 0x0555;		   //EPWM5A always low,modify it when  control start
	EPwm7Regs.AQCTLB.all=0x0555; 		   //EPWM5B always low
	EPwm7Regs.AQCTLA.bit.ZRO = AQ_SET;
	EPwm7Regs.AQCTLA.bit.CAU = AQ_CLEAR;
	EPwm7Regs.CMPA.bit.CMPA = 1200;
	EPwm7Regs.CMPB.bit.CMPB = 1200;		   //20%
	EPwm7Regs.DBCTL.bit.OUT_MODE = 0;	   // disable Dead-band module
	EPwm7Regs.ETPS.bit.INTCNT = 0;

	EPwm7Regs.ETPS.bit.INTPRD = ET_1ST;	   //first envent trigger
	EPwm7Regs.ETSEL.bit.INTEN = 0;//enable PWM int
	EPwm7Regs.ETSEL.bit.INTSEL = ET_CTR_ZERO;//Enable event time-base counter equal to zero.
	EPwm7Regs.ETCLR.bit.INT = 1; 		   //Clears the ETFLG[INT] flag bit


    // PWM8A/8B for LLC???12à
    EALLOW;
    EPwm8Regs.TZCTL.bit.TZA = TZ_FORCE_LO;          //force low
    EPwm8Regs.TZCTL.bit.TZB = TZ_FORCE_LO;          //force low
    EPwm8Regs.AQSFRC.bit.RLDCSF = 2;
    EDIS;
    EPwm8Regs.AQCSFRC.all = 0x5; // CSFA = 1, CSFB = 1;
    EPwm8Regs.TBPRD = wLLCPwmPeriod;           // Period = 1200 TBCLK counts
    EPwm8Regs.TBPHS.bit.TBPHS = 0;                  // Set Phase register to zero   //ò???CNT
    EPwm8Regs.TBCTR = 0x0000;                       // Clear counter    ó? TBPHSò??ù
    EPwm8Regs.TBCTL.bit.CLKDIV = CHP_DIV1;          // TBCLK = SYSCLKOUT / (HSPCLKDIV*CLKDIV)
    EPwm8Regs.TBCTL.bit.HSPCLKDIV = CHP_DIV1;       // =120M/(1*1)
    EPwm8Regs.TBCTL.bit.CTRMODE = TB_COUNT_UPDOWN;  // up-down mode
    EPwm8Regs.TBCTL.bit.PHSEN = TB_DISABLE;          // Do not load the time-base counter (TBCTR) from the time-base phase register (TBPHS)
    EPwm8Regs.TBCTL.bit.PRDLD = TB_SHADOW;          // loaded the TBPRD from shadow register when TBCTR is equal to zero
    //EPwm8Regs.TBCTL.bit.PRDLD = TB_IMMEDIATE;     // load the TBPRD immediately  preriod interrupt couldn't take palce?
    //EPwm8Regs.TBCTL.bit.SWFSYNC = 0;                // TB_SYNC_DISABLE; // Disable EPWMxSYNCO signal
	EPwm8Regs.TBCTL.bit.SYNCOSEL = TB_CTR_ZERO;
	EPwm8Regs.TBCTL.bit.PHSDIR = TB_UP;

    //EPwm8Regs.TBCTL2.bit.PRDLDSYNC = 2;             // 15:14 PRD Shadow to Active Load on SYNC Event
    //EPwm8Regs.EPWMSYNCINSEL.bit.SEL = 3;          //  base PWM3

    EPwm8Regs.CMPCTL.bit.SHDWAMODE = CC_SHADOW;     // load CMPA from shadow register
    EPwm8Regs.CMPCTL.bit.LOADAMODE = CC_CTR_ZERO;   // load CMPA on CTR=0
    EPwm8Regs.CMPCTL.bit.SHDWBMODE = CC_SHADOW;
    EPwm8Regs.CMPCTL.bit.LOADBMODE = CC_CTR_PRD;
    EPwm8Regs.AQCTLA.all = 0x0555;                  // EPWM1A always low,modify it when  control start
    EPwm8Regs.AQCTLB.all = 0x0555;                  // EPWM1B always low
    EPwm8Regs.CMPA.bit.CMPA = 0xFFFF;
    EPwm8Regs.CMPB.all = 0xFFFF;

    EPwm8Regs.DBCTL.bit.OUT_MODE = DB_DISABLE;      // disable DB first,enable it  when control start
    EPwm8Regs.DBCTL.bit.POLSEL = DB_ACTV_HIC;       // Active Hi complementary
    EPwm8Regs.DBFED.all = 0;                        // 3% = 1200*2/100*4   0.8us
    EPwm8Regs.DBRED.all = 0;                        // 3% = 1200*2/100*4   0.8us

    EPwm8Regs.ETPS.bit.INTCNT = 0;
    EPwm8Regs.ETPS.bit.INTPRD = ET_1ST;             // first envent trigger
    EPwm8Regs.ETSEL.bit.INTEN = 0;  // enable PWM int
    EPwm8Regs.ETSEL.bit.INTSEL = ET_CTR_ZERO;   // Enable event time-base counter equal to zero.
    //EPwm8Regs.ETSEL.bit.INTSEL = ET_CTR_PRD;        // Enable event time-base counter equal to period
    //EPwm8Regs.ETSEL.bit.INTSEL = ET_CTR_PRD;      // timebase counter equal to period
    EPwm8Regs.ETCLR.bit.INT = 1;                    // Clears the ETFLG[INT] flag bit
    
	EPwm8Regs.AQCTLA.all = 0;
	EPwm8Regs.AQCTLA.bit.ZRO = AQ_SET;
	EPwm8Regs.AQCTLA.bit.CAU = AQ_CLEAR;
	EPwm8Regs.CMPA.bit.CMPA = 0;

	EPwm8Regs.AQCTLB.all = 0;
	EPwm8Regs.AQCTLB.bit.PRD = AQ_SET;
	EPwm8Regs.AQCTLB.bit.CBD = AQ_CLEAR;
	EPwm8Regs.CMPB.all = wLLCPwmPeriod;
	
	//LLC
    // PWM9A/9B for LLCμí?12à
    EALLOW;
    EPwm9Regs.TZCTL.bit.TZA = TZ_FORCE_LO;          // force low
    EPwm9Regs.TZCTL.bit.TZB = TZ_FORCE_LO;          // force low
    EPwm9Regs.AQSFRC.bit.RLDCSF = 2;
    EDIS;
	EPwm9Regs.AQCSFRC.all = 0x5; // CSFA = 1, CSFB = 1;
    EPwm9Regs.TBPRD = wLLCPwmPeriod;           // Period = 1200 TBCLK counts
    EPwm9Regs.TBPHS.bit.TBPHS = 0;                  // Set Phase register to zero
    EPwm9Regs.TBCTR = 0x0000;                       // Clear counter
    EPwm9Regs.TBCTL.bit.CLKDIV = CHP_DIV1;          // TBCLK = SYSCLKOUT / (HSPCLKDIV*CLKDIV)
    EPwm9Regs.TBCTL.bit.HSPCLKDIV = CHP_DIV1;       // =120M/(1*1)
    EPwm9Regs.TBCTL.bit.CTRMODE = TB_COUNT_UPDOWN;  // up-down mode
    EPwm9Regs.TBCTL.bit.PHSEN = TB_DISABLE;         // Do not load the time-base counter (TBCTR) from the time-base phase register (TBPHS)
    EPwm9Regs.TBCTL.bit.PRDLD = TB_SHADOW;          // loaded the TBPRD from shadow register when TBCTR is equal to zero
    EPwm9Regs.TBCTL.bit.SYNCOSEL = TB_SYNC_IN;
	EPwm9Regs.TBCTL.bit.PHSDIR = TB_UP;

    EPwm9Regs.CMPCTL.bit.SHDWAMODE = CC_SHADOW;     // load CMPA from shadow register
    EPwm9Regs.CMPCTL.bit.LOADAMODE = CC_CTR_PRD;   // load CMPA on CTR=0
    EPwm9Regs.CMPCTL.bit.SHDWBMODE = CC_SHADOW;
    EPwm9Regs.CMPCTL.bit.LOADBMODE = CC_CTR_ZERO;
    EPwm9Regs.AQCTLA.all = 0x0555;                  // EPWM1A always low,modify it when  control start
    EPwm9Regs.AQCTLB.all = 0x0555;                  // EPWM1B always low
    EPwm9Regs.CMPA.bit.CMPA = 0xFFFF;
    EPwm9Regs.CMPB.all = 0xFFFF;

    EPwm9Regs.DBCTL.bit.OUT_MODE = DB_DISABLE;      // disable DB first,enable it  when control start
    EPwm9Regs.DBCTL.bit.POLSEL = DB_ACTV_HIC;       // Active Hi complementary
    EPwm9Regs.DBFED.all = 0;                        // 3% = 1200*2/100*4   0.8us
    EPwm9Regs.DBRED.all = 0;                        // 3% = 1200*2/100*4   0.8us

    EPwm9Regs.ETPS.bit.INTCNT = 0;
    EPwm9Regs.ETPS.bit.INTPRD = ET_1ST;             // first envent trigger
    EPwm9Regs.ETSEL.bit.INTEN = 0;      // enable PWM int
    EPwm9Regs.ETSEL.bit.INTSEL = ET_CTR_ZERO;   // Enable event time-base counter equal to zero.
    //EPwm9Regs.ETSEL.bit.INTSEL = ET_CTR_PRD;      // timebase counter equal to period
    EPwm9Regs.ETCLR.bit.INT = 1;                    // Clears the ETFLG[INT] flag bit

