pwg-pwg/test/IVPMP2G2-PRO_APP/trunk/01_SourceCode/08_F2837xS_IVPMP2G2_APP/Source/APP/Initial.c
	EPwm9Regs.AQCTLA.all = 0;
	EPwm9Regs.AQCTLA.bit.ZRO = AQ_SET;
	EPwm9Regs.AQCTLA.bit.CAU = AQ_CLEAR;
	EPwm9Regs.CMPA.all = 0;
	EPwm9Regs.AQCTLB.all = 0;
	EPwm9Regs.AQCTLB.bit.PRD = AQ_SET;
	EPwm9Regs.AQCTLB.bit.CBD = AQ_CLEAR;
	EPwm9Regs.CMPB.bit.CMPB = wLLCPwmPeriod;

//	EALLOW;
//    EPwm10Regs.TZCTL.bit.TZA = TZ_FORCE_LO;          // force low
//    EPwm10Regs.TZCTL.bit.TZB = TZ_FORCE_LO;          // force low
//    EPwm10Regs.AQSFRC.bit.RLDCSF = 2;
//    EDIS;
//	EPwm10Regs.AQCSFRC.all = 0x5; // CSFA = 1, CSFB = 1;
//    EPwm10Regs.TBPRD = cBOOST_PWM_PERIOD;           // Period = 1200 TBCLK counts
//    EPwm10Regs.TBPHS.bit.TBPHS = 0;                  // Set Phase register to zero
//    EPwm10Regs.TBCTR = 0x0000;                       // Clear counter
//    EPwm10Regs.TBCTL.bit.CLKDIV = CHP_DIV1;          // TBCLK = SYSCLKOUT / (HSPCLKDIV*CLKDIV)
//    EPwm10Regs.TBCTL.bit.HSPCLKDIV = CHP_DIV1;       // =120M/(1*1)
//    EPwm10Regs.TBCTL.bit.CTRMODE = TB_COUNT_UPDOWN;  // up-down mode
//    EPwm10Regs.TBCTL.bit.PHSEN = TB_DISABLE;         // Do not load the time-base counter (TBCTR) from the time-base phase register (TBPHS)
//    EPwm10Regs.TBCTL.bit.PRDLD = TB_SHADOW;          // loaded the TBPRD from shadow register when TBCTR is equal to zero
//    EPwm10Regs.TBCTL.bit.SYNCOSEL = TB_SYNC_IN;
//	EPwm10Regs.TBCTL.bit.PHSDIR = TB_UP;

//    EPwm10Regs.CMPCTL.bit.SHDWAMODE = CC_SHADOW;     // load CMPA from shadow register
//    EPwm10Regs.CMPCTL.bit.LOADAMODE = CC_CTR_ZERO;   // load CMPA on CTR=0
//    EPwm10Regs.CMPCTL.bit.SHDWBMODE = CC_SHADOW;
//    EPwm10Regs.CMPCTL.bit.LOADBMODE = CC_CTR_ZERO;
//    EPwm10Regs.AQCTLA.all = 0x0555;                  // EPWM1A always low,modify it when  control start
//    EPwm10Regs.AQCTLB.all = 0x0555;                  // EPWM1B always low
//    EPwm10Regs.CMPA.bit.CMPA = 0xFFFF;
//    EPwm10Regs.CMPB.all = 0xFFFF;

//    EPwm10Regs.DBCTL.bit.OUT_MODE = DB_DISABLE;      // disable DB first,enable it  when control start
//    EPwm10Regs.DBCTL.bit.POLSEL = DB_ACTV_HIC;       // Active Hi complementary
//    EPwm10Regs.DBFED.all = 0;                        // 3% = 1200*2/100*4   0.8us
//    EPwm10Regs.DBRED.all = 0;                        // 3% = 1200*2/100*4   0.8us

//    EPwm10Regs.ETPS.bit.INTCNT = 0;
//    EPwm10Regs.ETPS.bit.INTPRD = ET_1ST;             // first envent trigger
//    EPwm10Regs.ETSEL.bit.INTEN = 0;      // enable PWM int
//    EPwm10Regs.ETSEL.bit.INTSEL = ET_CTR_ZERO;   // Enable event time-base counter equal to zero.
//    //EPwm10Regs.ETSEL.bit.INTSEL = ET_CTR_PRD;      // timebase counter equal to period
//    EPwm10Regs.ETCLR.bit.INT = 1;                    // Clears the ETFLG[INT] flag bit

//    EPwm10Regs.AQCTLA.all = 0;
//    EPwm10Regs.AQCTLA.bit.CAU = AQ_CLEAR;
//    EPwm10Regs.AQCTLA.bit.CAD = AQ_SET;
//    EPwm10Regs.CMPA.bit.CMPA = 0;

//    EPwm10Regs.AQCTLB.all = 0;
//    EPwm10Regs.AQCTLB.bit.CBU = AQ_SET;
//    EPwm10Regs.AQCTLB.bit.CBD = AQ_CLEAR;
//    EPwm10Regs.CMPB.all = cBOOST_PWM_PERIOD;

//    EPwm10Regs.ETSEL.bit.SOCAEN = 0;     // Disable SOC on A group
//    EPwm10Regs.ETSEL.bit.SOCASEL = 3;    // Select SOC on zero or period
//    EPwm10Regs.ETPS.bit.SOCAPRD = 1;     // Generate pulse on 1st event
//    EPwm10Regs.ETSEL.bit.SOCAEN = 1;    // Enable SOCA

    //FAN
    EPwm11Regs.AQSFRC.bit.RLDCSF = 3;
    EPwm11Regs.AQCSFRC.all = 0x5; // CSFA = 1, CSFB = 1;
    EPwm11Regs.TBPRD = cFAN_PWM_PERIOD; // FAN  PWM ,2KHz
    EPwm11Regs.TBPHS.bit.TBPHS = 0; // Set Phase register to zero
    EPwm11Regs.TBCTR = 0x0000;       // Clear counter
    EPwm11Regs.TBCTL.bit.CLKDIV = CHP_DIV1; // TBCLK = SYSCLKOUT / (HSPCLKDIV*CLKDIV)
    EPwm11Regs.TBCTL.bit.HSPCLKDIV = CHP_DIV1;//=100M/(1*1)
    EPwm11Regs.TBCTL.bit.CTRMODE = TB_COUNT_UP; // up-down mode
    EPwm11Regs.TBCTL.bit.PHSEN = TB_DISABLE; //Do not load the time-base counter (TBCTR) from the time-base phase register (TBPHS)
    EPwm11Regs.TBCTL.bit.PRDLD = TB_SHADOW;  //loaded the TBPRD from shadow register when TBCTR is equal to zero
    EPwm11Regs.TBCTL.bit.SYNCOSEL = TB_CTR_ZERO;
	EPwm11Regs.TBCTL.bit.PHSDIR = TB_UP;
    EPwm11Regs.CMPCTL.bit.SHDWAMODE = CC_SHADOW;  //load CMPA from shadow register
    EPwm11Regs.CMPCTL.bit.LOADAMODE = CC_CTR_ZERO;  //load CMPA on CTR=0
    EPwm11Regs.CMPCTL.bit.SHDWBMODE = CC_SHADOW;
    EPwm11Regs.CMPCTL.bit.LOADBMODE = CC_CTR_ZERO;
    EPwm11Regs.AQCTLA.all = 0x0555;          //EPWM1A always low,modify it when  control start
    //EPwm11Regs.AQCTLB.all = 0x0555;          //EPWM1B always low
    EPwm11Regs.AQCTLB.bit.CBU = AQ_CLEAR;
    EPwm11Regs.AQCTLB.bit.ZRO = AQ_SET;
    EPwm11Regs.CMPA.bit.CMPA = 0xFFFF;
    EPwm11Regs.CMPB.bit.CMPB = 0xFFFF;

    EPwm11Regs.DBCTL.bit.OUT_MODE = DB_DISABLE; //disable DB first,enable it  when control start
    EPwm11Regs.DBCTL.bit.POLSEL = 0; // Active Hi complementary
    EPwm11Regs.DBFED.bit.DBFED = 0;
    EPwm11Regs.DBRED.bit.DBRED = 0;

    EPwm11Regs.ETPS.bit.INTCNT = 0;
    EPwm11Regs.ETPS.bit.INTPRD = ET_1ST;         //first envent trigger
    EPwm11Regs.ETSEL.bit.INTEN = 0;  //enable PWM int
    EPwm11Regs.ETSEL.bit.INTSEL = ET_CTR_ZERO;    //Enable event time-base counter equal to zero
    EPwm11Regs.ETCLR.bit.INT = 1;    //Clears the ETFLG[INT] flag bit

	EPwm12Regs.AQSFRC.bit.RLDCSF = 3;
	EPwm12Regs.AQCSFRC.all = 0x5; // CSFA = 1, CSFB = 1;
    EPwm12Regs.TBPRD = cFAN_PWM_PERIOD; // FAN  PWM ,2KHz
    EPwm12Regs.TBPHS.bit.TBPHS = 0; // Set Phase register to zero
    EPwm12Regs.TBCTR = 0x0000;       // Clear counter
    EPwm12Regs.TBCTL.bit.CLKDIV = CHP_DIV1; // TBCLK = SYSCLKOUT / (HSPCLKDIV*CLKDIV)
    EPwm12Regs.TBCTL.bit.HSPCLKDIV = CHP_DIV1;//=100M/(1*1)
    EPwm12Regs.TBCTL.bit.CTRMODE = TB_COUNT_UP; // up-down mode
    EPwm12Regs.TBCTL.bit.PHSEN = TB_ENABLE; //Do not load the time-base counter (TBCTR) from the time-base phase register (TBPHS)
    EPwm12Regs.TBCTL.bit.PRDLD = TB_SHADOW;  //loaded the TBPRD from shadow register when TBCTR is equal to zero
    EPwm12Regs.TBCTL.bit.SYNCOSEL = TB_SYNC_IN;
	EPwm12Regs.TBCTL.bit.PHSDIR = TB_UP;
    EPwm12Regs.CMPCTL.bit.SHDWAMODE = CC_SHADOW;  //load CMPA from shadow register
    EPwm12Regs.CMPCTL.bit.LOADAMODE = CC_CTR_ZERO;  //load CMPA on CTR=0
    EPwm12Regs.CMPCTL.bit.SHDWBMODE = CC_SHADOW;
    EPwm12Regs.CMPCTL.bit.LOADBMODE = CC_CTR_ZERO;
    EPwm12Regs.AQCTLB.bit.CBU = AQ_CLEAR;
    EPwm12Regs.AQCTLB.bit.ZRO = AQ_SET;
	EPwm12Regs.AQCTLA.bit.CAU = AQ_CLEAR;
    EPwm12Regs.AQCTLA.bit.ZRO = AQ_SET;
    EPwm12Regs.CMPA.bit.CMPA = 0xFFFF;
    EPwm12Regs.CMPB.bit.CMPB = 0xFFFF;

    EPwm12Regs.DBCTL.bit.OUT_MODE = DB_DISABLE; //disable DB first,enable it  when control start
    EPwm12Regs.DBCTL.bit.POLSEL = 0; // Active Hi complementary
    EPwm12Regs.DBFED.bit.DBFED = 0;
    EPwm12Regs.DBRED.bit.DBRED = 0;

    EPwm12Regs.ETPS.bit.INTCNT = 0;
    EPwm12Regs.ETPS.bit.INTPRD = ET_1ST;         //first envent trigger
    EPwm12Regs.ETSEL.bit.INTEN = 0;  //enable PWM int
    EPwm12Regs.ETSEL.bit.INTSEL = ET_CTR_ZERO;    //Enable event time-base counter equal to zero
    EPwm12Regs.ETCLR.bit.INT = 1;    //Clears the ETFLG[INT] flag bit


    EALLOW;
    CpuSysRegs.PCLKCR0.bit.TBCLKSYNC = 1;         // Start all the timers synced
    EDIS;
}

//---------------------------------------------------------------------------
// InitECAP:
//---------------------------------------------------------------------------
// This function initializes the eCAP registers to a known state.
//---------------------------------------------------------------------------
void sInitEcap(void)  //eCAP
{
    //EALLOW;
    //ECap1Regs.ECAPSYNCINSEL.bit.SEL = 0;
    ECap1Regs.ECEINT.all = 0x0000;             // Disable all capture interrupts
    ECap1Regs.ECCLR.all = 0xFFFF;              // Clear all CAP interrupt flags
    ECap1Regs.ECCTL1.bit.CAPLDEN = 0;          // Disable CAP register loads
    ECap1Regs.ECCTL2.bit.TSCTRSTOP = 0;        // Make sure the counter is stopped
    ECap1Regs.ECCTL2.bit.CAP_APWM = 0;         // eCAP mode
    ECap1Regs.ECCTL2.bit.CONT_ONESHT = 1;      // one-shot mode
    ECap1Regs.ECCTL2.bit.SYNCO_SEL = 2;        // disable sync out signal
    ECap1Regs.ECCTL2.bit.SYNCI_EN = 0;         // disable synv in option
    ECap1Regs.ECCTL2.bit.STOP_WRAP = 0;        // Stop after Capture Event 1 in one-shot mode
    ECap1Regs.ECCTL1.bit.CAP1POL = 1;          // Falling edge
    ECap1Regs.ECCTL1.bit.CTRRST1 = 0;          // do not reset counter
    ECap1Regs.ECCTL1.bit.PRESCALE = 0;         // div= /1
//    ECap1Regs.ECEINT.all             = 0x0000;  // Disable all capture interrupts
//	ECap1Regs.ECCLR.all              = 0xFFFF;  // Clear all CAP interrupt flags
//	ECap1Regs.ECCTL1.bit.CAP1POL     = 1;		//Fall edge  ?à??	0 rising edge
//	ECap1Regs.ECCTL1.bit.CTRRST1     = 0;		//0=×?óé??êy
//	ECap1Regs.ECCTL1.bit.CAPLDEN     = 1;		//Disable CAP1-CAP4 register loads
//	ECap1Regs.ECCTL1.bit.PRESCALE    = 0;		//input prescale /40=0X14
//	ECap1Regs.ECCTL2.bit.CAP_APWM    = 0;
//	ECap1Regs.ECCTL2.bit.STOP_WRAP   = 0;		//Stop at 1 events
//	ECap1Regs.ECCTL2.bit.CONT_ONESHT = 0;
//	ECap1Regs.ECCTL2.bit.SYNCO_SEL   = 2;		//C_SYNCO_DIS
//	ECap1Regs.ECCTL2.bit.SYNCI_EN    = 0;		//C_DISABLE
//	ECap1Regs.ECCTL2.bit.TSCTRSTOP   = 1; 	    //C_RUN AllowTSCTR to run
//	ECap1Regs.ECEINT.bit.CEVT1       = 1;       //1 events = interrupt
    InputXbarRegs.INPUT7SELECT = 53;
    //ECap1Regs.ECCTL0.bit.INPUTSEL = 3;         // ECap1 captures pins corresponding to INTPUT4

    //ECap2Regs.ECAPSYNCINSEL.bit.SEL = 0x11;
    ECap2Regs.ECEINT.all = 0x0000;             // Disable all capture interrupts
    ECap2Regs.ECCLR.all = 0xFFFF;              // Clear all CAP interrupt flags
    ECap2Regs.ECCTL1.bit.CAPLDEN = 0;          // Disable CAP register loads
    ECap2Regs.ECCTL2.bit.TSCTRSTOP = 0;        // Make sure the counter is stopped
    ECap2Regs.ECCTL2.bit.CAP_APWM = 0;         // eCAP mode
    ECap2Regs.ECCTL2.bit.CONT_ONESHT = 1;      // one-shot mode
    ECap2Regs.ECCTL2.bit.SYNCO_SEL = 2;        // disable sync out signal
    ECap2Regs.ECCTL2.bit.SYNCI_EN = 0;         // disable synv in option
    ECap2Regs.ECCTL2.bit.STOP_WRAP = 0;        // Stop after Capture Event 1 in one-shot mode
    ECap2Regs.ECCTL1.bit.CAP1POL = 0;          // Rising edge
    ECap2Regs.ECCTL1.bit.CTRRST1 = 0;          // do not reset counter
    ECap2Regs.ECCTL1.bit.PRESCALE = 0;         // div= /1
    InputXbarRegs.INPUT8SELECT = 52;
    //ECap2Regs.ECCTL0.bit.INPUTSEL = 4;         // ECap1 captures pins corresponding to INTPUT5

    //ECap3Regs.ECAPSYNCINSEL.bit.SEL = 0x11;
    ECap3Regs.ECEINT.all = 0x0000;             // Disable all capture interrupts
    ECap3Regs.ECCLR.all = 0xFFFF;              // Clear all CAP interrupt flags
    ECap3Regs.ECCTL1.bit.CAPLDEN = 0;          // Disable CAP register loads
    ECap3Regs.ECCTL2.bit.TSCTRSTOP = 0;        // Make sure the counter is stopped
    ECap3Regs.ECCTL2.bit.CAP_APWM = 0;         // eCAP mode
    ECap3Regs.ECCTL2.bit.CONT_ONESHT = 1;      // one-shot mode
    ECap3Regs.ECCTL2.bit.SYNCO_SEL = 2;        // disable sync out signal
    ECap3Regs.ECCTL2.bit.SYNCI_EN = 0;         // disable synv in option
    ECap3Regs.ECCTL2.bit.STOP_WRAP = 0;        // Stop after Capture Event 1 in one-shot mode
    ECap3Regs.ECCTL1.bit.CAP1POL = 1;          // Falling edge
    ECap3Regs.ECCTL1.bit.CTRRST1 = 0;          // do not reset counter
    ECap3Regs.ECCTL1.bit.PRESCALE = 0;         // div= /1
    InputXbarRegs.INPUT9SELECT = 54;
    //ECap3Regs.ECCTL0.bit.INPUTSEL = 5;         // ECap1 captures pins corresponding to INTPUT6

    ECap1Regs.ECCTL2.bit.REARM = 1;            // arm one-shot
    ECap1Regs.ECCTL1.bit.CAPLDEN = 1;          // Enable CAP1-CAP4 register loads
    ECap1Regs.ECEINT.bit.CEVT1 = 1;            // 1 events = interrupt

    ECap2Regs.ECCTL2.bit.REARM = 1;            // arm one-shot
    ECap2Regs.ECCTL1.bit.CAPLDEN = 1;          // Enable CAP1-CAP4 register loads
    ECap2Regs.ECEINT.bit.CEVT1 = 1;            // 1 events = interrupt

    ECap3Regs.ECCTL2.bit.REARM = 1;            // arm one-shot
    ECap3Regs.ECCTL1.bit.CAPLDEN = 1;          // Enable CAP1-CAP4 register loads
    ECap3Regs.ECEINT.bit.CEVT1 = 1;            // 1 events = interrupt

    //Enable Capture Event 1 as an Interrupt source
    ECap1Regs.ECCTL2.bit.TSCTRSTOP = 1;        // Start Counter
    ECap2Regs.ECCTL2.bit.TSCTRSTOP = 1;        // Start Counter
    ECap3Regs.ECCTL2.bit.TSCTRSTOP = 1;        // Start Counter

    /*//test vce fault
    ECap3Regs.ECEINT.all = 0x0000;             // Disable all capture interrupts
    ECap3Regs.ECCLR.all = 0xFFFF;              // Clear all CAP interrupt flags
    ECap3Regs.ECCTL1.bit.CAPLDEN = 1;          // Disable CAP register loads
    ECap3Regs.ECCTL2.bit.TSCTRSTOP = 0;        // Make sure the counter is stopped
    ECap3Regs.ECCTL2.bit.CAP_APWM = 0;         // eCAP mode
    ECap3Regs.ECCTL2.bit.CONT_ONESHT = 0;      // one-shot mode
    ECap3Regs.ECCTL2.bit.SYNCO_SEL = 3;        // disable sync out signal
    ECap3Regs.ECCTL2.bit.SYNCI_EN = 0;         // disable synv in option
    ECap3Regs.ECCTL2.bit.STOP_WRAP = 1;        // Stop after Capture Event 1 in one-shot mode
    ECap3Regs.ECCTL1.bit.CAP1POL = 1;          // Falling edge
    ECap3Regs.ECCTL1.bit.CAP2POL = 0;          // Rising edge
    ECap3Regs.ECCTL1.bit.CTRRST1 = 0;          // do not reset counter
    ECap3Regs.ECCTL1.bit.CTRRST2 = 1;          // do not reset counter
    ECap3Regs.ECCTL1.bit.PRESCALE = 0;         // div= /1
    ECap3Regs.ECCTL0.bit.INPUTSEL = 5;         // ECap1 captures pins corresponding to INTPUT6

    ECap3Regs.ECCTL2.bit.REARM = 1;            // arm one-shot
    ECap3Regs.ECCTL1.bit.CAPLDEN = 1;          // Enable CAP1-CAP4 register loads
    //ECap3Regs.ECEINT.bit.CEVT1 = 1;            // 1 events = interrupt
    ECap3Regs.ECEINT.bit.CEVT2 = 1;            // 1 events = interrupt

    //Enable Capture Event 1 as an Interrupt source
    ECap3Regs.ECCTL2.bit.TSCTRSTOP = 1;        // Start Counter*/


    //EDIS;
}
void sInitSci(void)
{
    ScibRegs.SCICCR.all = 0x07;// One stop bit, no parity, 8-bit character length
    ScibRegs.SCICTL1.all = 0x03;// Enable transmit and receive
	#ifdef SCI_BRP_19200
    //19200
    ScibRegs.SCIHBAUD.bit.BAUD= 0x01;
    ScibRegs.SCILBAUD.bit.BAUD= 0x45;
	#else
	//9600
    ScibRegs.SCIHBAUD.bit.BAUD= 0x02;
    ScibRegs.SCILBAUD.bit.BAUD= 0x8A;
	#endif
    // Enable Receive interrupt and transmit interrupt
    ScibRegs.SCICTL2.all = 0x03;
    ScibRegs.SCICTL1.all = 0x0023;     // Relinquish SCI from Reset

    
    ScicRegs.SCICCR.all=0x07;// One stop bit, no parity, 8-bit character length
    ScicRegs.SCICTL1.all=0x03;// Enable transmit and receive
	#ifdef SCI_BRP_19200
    //19200
    ScicRegs.SCIHBAUD.bit.BAUD = 0x01;
    ScicRegs.SCILBAUD.bit.BAUD = 0x45;
	#else
	//9600 baud rate
	ScicRegs.SCIHBAUD.bit.BAUD= 0x02;
	ScicRegs.SCILBAUD.bit.BAUD= 0x8A;
	#endif
    ScicRegs.SCICTL2.all=0x03;// Enable Receive interrupt and transmit interrupt
    ScicRegs.SCICTL1.all =0x23;// Relinquish SCI from Reset


