pwg-pwg/test/IVPMP2G2-PRO_APP/trunk/01_SourceCode/08_F2837xS_IVPMP2G2_APP/Source/APP/Initial.c
    //Maximum SAMPWIN value provides largest number of samples
    CmpssReg->CTRIPHFILCTL.bit.SAMPWIN = 0x0A;//all window 32
    CmpssReg->CTRIPLFILCTL.bit.SAMPWIN = 0x0A;//all window 32

    //Maximum THRESH value requires static value for entire window
    //  THRESH should be GREATER than half of SAMPWIN
    CmpssReg->CTRIPHFILCTL.bit.THRESH = 7;//all
    CmpssReg->CTRIPLFILCTL.bit.THRESH = 7;//all

    //Reset filter logic & start filtering
    CmpssReg->CTRIPHFILCTL.bit.FILINIT = 1;
    CmpssReg->CTRIPLFILCTL.bit.FILINIT = 1;

    //Comparator Hysteresis Trim
    CmpssReg->COMPHYSCTL.bit.COMPHYS = 4;

    //
    // Configure CTRIPOUT path
    // Digital filter output feeds CTRIPH and CTRIPOUTH
    //
    CmpssReg->COMPCTL.bit.CTRIPHSEL = 0;
    CmpssReg->COMPCTL.bit.CTRIPLSEL = 0;

    CmpssReg->COMPCTL.bit.CTRIPOUTHSEL = 0;
    CmpssReg->COMPCTL.bit.CTRIPOUTLSEL = 0;

    //
    //Enable CMPSS
    //
    CmpssReg->COMPCTL.bit.COMPDACE = 1;

    EDIS;
}

void InitPWMCombinTrip(volatile struct EPWM_REGS *EPwmReg)
{
    EALLOW;
    //Configure EPWMB to output low on TZB TRIP
    EPwmReg->TZCTL.bit.TZA = TZ_FORCE_LO;
    EPwmReg->TZCTL.bit.TZB = TZ_FORCE_LO;

    //Configure DCA to be TRIP4
    EPwmReg->TZSEL.bit.DCAEVT2 = 1;
    EPwmReg->TZDCSEL.bit.DCAEVT2 = TZ_DCBH_HI;
    EPwmReg->DCTRIPSEL.bit.DCAHCOMPSEL = 0xF;
    EPwmReg->DCAHTRIPSEL.bit.TRIPINPUT4 = 1;

    //Configure DCB to be TRIP4
    EPwmReg->TZSEL.bit.DCBEVT2 = 1;
    EPwmReg->TZDCSEL.bit.DCBEVT2 = TZ_DCBH_HI;
    EPwmReg->DCTRIPSEL.bit.DCBHCOMPSEL = 0xF;
    EPwmReg->DCBHTRIPSEL.bit.TRIPINPUT4 = 1;

    //Configure DCA to be TRIP5
    EPwmReg->DCAHTRIPSEL.bit.TRIPINPUT5 = 1;

    //Configure DCB to be TRIP5
    EPwmReg->DCBHTRIPSEL.bit.TRIPINPUT5 = 1;

    //Configure DCA DCB as OST
    //EPwmReg->TZSEL.bit.DCAEVT1 = 1;
    //EPwmReg->TZSEL.bit.DCBEVT1 = 1;

    //Configure DCB path to be unfiltered & async
    EPwmReg->DCACTL.bit.EVT2SRCSEL = DC_EVT2;
    EPwmReg->DCACTL.bit.EVT2FRCSYNCSEL = DC_EVT_SYNC;
    EPwmReg->DCBCTL.bit.EVT2SRCSEL = DC_EVT2;
    EPwmReg->DCBCTL.bit.EVT2FRCSYNCSEL = DC_EVT_ASYNC;

    // Clear trip flags
    EPwmReg->TZCLR.bit.CBCPULSE = 1;
    EPwmReg->TZCLR.bit.OST = 1;
    EPwmReg->TZCLR.bit.CBC = 1;
    EPwmReg->TZCLR.bit.INT = 1;

    EDIS;
}

void sInitCmpss(void)
{
	if(g_wVAType == cb12KVAModel)
	{
	    InitCMPSS(&Cmpss1Regs,PRI_OCP_CMSS_H_PRO_POINT_12K,PRI_OCP_CMSS_L_PRO_POINT_12K);
	    InitCMPSS(&Cmpss2Regs,PRI_OCP_CMSS_H_PRO_POINT_12K,PRI_OCP_CMSS_L_PRO_POINT_12K);
	}
	else if(g_wVAType == cb10KVAModel)
	{
		InitCMPSS(&Cmpss1Regs,PRI_OCP_CMSS_H_PRO_POINT_10K,PRI_OCP_CMSS_L_PRO_POINT_10K);
	    InitCMPSS(&Cmpss2Regs,PRI_OCP_CMSS_H_PRO_POINT_10K,PRI_OCP_CMSS_L_PRO_POINT_10K);
	}
	else//8K
	{
		InitCMPSS(&Cmpss1Regs,PRI_OCP_CMSS_H_PRO_POINT_8K,PRI_OCP_CMSS_L_PRO_POINT_8K);
	    InitCMPSS(&Cmpss2Regs,PRI_OCP_CMSS_H_PRO_POINT_8K,PRI_OCP_CMSS_L_PRO_POINT_8K);
	}

    InitPWMCombinTrip(&EPwm1Regs);
    InitPWMCombinTrip(&EPwm2Regs);
    InitPWMCombinTrip(&EPwm3Regs);
    InitPWMCombinTrip(&EPwm4Regs);

    EALLOW;
    EPwm1Regs.TZCLR.bit.CBCPULSE = 1;
    EPwm2Regs.TZCLR.bit.CBCPULSE = 0;
    EPwm3Regs.TZCLR.bit.CBCPULSE = 0;
    EPwm4Regs.TZCLR.bit.CBCPULSE = 1;
    EDIS;

    EALLOW;
    //Configure TRIP4 to be CTRIP1H or CTRIP1L CMPSS1
    EPwmXbarRegs.TRIP4MUX0TO15CFG.bit.MUX0 = 1;

    //Enable TRIP4 Mux for Output
    EPwmXbarRegs.TRIP4MUXENABLE.bit.MUX0 = 1;

    //Configure TRIP5 to be CTRIPH or CTRIPL CMPSS2
    EPwmXbarRegs.TRIP5MUX0TO15CFG.bit.MUX2 = 1;

    //Enable TRIP4 Mux for Output
    EPwmXbarRegs.TRIP5MUXENABLE.bit.MUX2 = 1;

    EDIS;
}


void sInitXint5(void)
{
	EALLOW;
	InputXbarRegs.INPUT14SELECT = cLLCOCIO;    
	EDIS;
	XintRegs.XINT5CR.bit.POLARITY = 0;    // Falling edge interrupt
	XintRegs.XINT5CR.bit.ENABLE = 1;      // Enable XINT5
}


/*********************************************************************
* Function: DelayUs()                                                *
* Description: Implements a time delay.                              *
* DSP: TMS320F2809                                                   *
* Last Modified: 06/28/02                                            *
* Include files: none                                                *
* Function Prototype: void DelayUs(volatile Uint16)                  *
* Useage: DelayUs(Usec);                                             *
* Input Parameters: Uint16 Usec = time delay in microseconds         *
* Return Value: none                                                 *
* Notes: The execution time of this routine is rough, based upon a   *
*        100MHz CPUCLK.  It has been tested using all optimization   *
*        levels of the compiler to give approximately a 1us inner    *
*        loop.                                                       *
*********************************************************************/

void DelayUs( volatile unsigned int Usec )
{
    while( Usec-- )                 // 1us loop at 100MHz CPUCLK
    {
        asm(" RPT #120 || NOP");
    }

}


/*-------------------------------------------------------------------------
Function Name: sModelIdentify
Abstract: Axpert model identify,including 1.5KVA,3KVA
Input   : None
Output  : None
History : 2014-12, for EX Axpert
-------------------------------------------------------------------------*/
void sModelIdentify(void)
{
	INT16U wADResult           = 0;
    INT16U w10KBatt48VModuleCnt  = 0;
    INT16U w15KBatt48VModuleCnt = 0;
	INT16U w12KBatt48VModuleCnt = 0;
	INT16U w8KBatt48VModuleCnt = 0;
    INT16U wElseBatt48VModuleCnt = 0;
	
	EALLOW;
    AdccRegs.ADCCTL2.bit.PRESCALE = 0x06;
	AdcSetMode(ADC_ADCC, ADC_RESOLUTION_12BIT, ADC_SIGNALMODE_SINGLE);
    AdccRegs.ADCCTL1.bit.INTPULSEPOS = 1;

    // Power up the ADC
    AdccRegs.ADCCTL1.bit.ADCPWDNZ = 1;
	
	sDelay1ms(100);
	
    EDIS;

    EALLOW;
    //Sample mode

    AdccRegs.ADCSOC0CTL.bit.CHSEL= 0;       // SOC0 will convert ADCINC0
    AdccRegs.ADCSOC1CTL.bit.CHSEL= 1;       // SOC1 will convert ADCINC1
    AdccRegs.ADCSOC2CTL.bit.CHSEL= 2;       // SOC2 will convert ADCINC2
    AdccRegs.ADCSOC3CTL.bit.CHSEL= 3;       // SOC3 will convert ADCINC3
    AdccRegs.ADCSOC14CTL.bit.CHSEL= 14;     // SOC14 will convert ADCINC14
    INT16U wTemp = 19;//14
    AdccRegs.ADCSOC0CTL.bit.ACQPS   = wTemp;
    AdccRegs.ADCSOC1CTL.bit.ACQPS   = wTemp;
    AdccRegs.ADCSOC2CTL.bit.ACQPS   = wTemp;
    AdccRegs.ADCSOC3CTL.bit.ACQPS   = wTemp;
	AdccRegs.ADCSOC14CTL.bit.ACQPS   = wTemp;
    AdccRegs.ADCSOC0CTL.bit.TRIGSEL     = 0;
    AdccRegs.ADCSOC1CTL.bit.TRIGSEL     = 0;
    AdccRegs.ADCSOC2CTL.bit.TRIGSEL     = 0;
    AdccRegs.ADCSOC3CTL.bit.TRIGSEL     = 0;
	AdccRegs.ADCSOC14CTL.bit.TRIGSEL     = 0;
    EDIS;

    EALLOW;
	GpioCtrlRegs.GPCPUD.bit.GPIO80 = 0;  // Enable pullup on GPIO80
    GpioDataRegs.GPCSET.bit.GPIO80= 1; // Load output latch to low
	GpioCtrlRegs.GPCMUX2.bit.GPIO80 = 0; // GPIO80 = I/O
	GpioCtrlRegs.GPCDIR.bit.GPIO80 = 1;  // GPIO80 = output
    EDIS;

	TEMP_SAMP_8_TO_1_A1();
	sDelay1ms(100);
	
    for(;;)
    {
		AdccRegs.ADCSOCFRC1.all=0x4000;
        while(AdccRegs.ADCCTL1.bit.ADCBSY==1);
        wADResult = ADCCRESULT14;

        if((2457 <= wADResult) && (wADResult < 3003))  // 15048:2.00V(1.8~2.2V)
        {
            w15KBatt48VModuleCnt++;
        }
        else if((1582 <= wADResult) && (wADResult < 1882))  //10048:(1.15V~1.378V)
        {
            w10KBatt48VModuleCnt++;
        }
		else if((1886 <= wADResult) && (wADResult < 2186))  //12048:(1381V~1.601V)
		{
			w12KBatt48VModuleCnt ++;
		}
		else if((1237 <= wADResult) && (wADResult < 1537))//8048:(0.906V~1.125V)
		{
			w8KBatt48VModuleCnt ++;
		}
		else
		{
			wElseBatt48VModuleCnt ++;
		}
        if(w10KBatt48VModuleCnt > 100)
        {
            g_wVAType = cb10KVAModel;
            sSetBatteryPcs(cbBatt48VType);
            break;
        }
        else if(w15KBatt48VModuleCnt > 100)
        {
            g_wVAType = cb15KVAModel;
            sSetBatteryPcs(cbBatt48VType);
            break;
        }
		else if(w12KBatt48VModuleCnt > 100)
		{
			g_wVAType = cb12KVAModel;
            sSetBatteryPcs(cbBatt48VType);
            break;
		}
		else if(w8KBatt48VModuleCnt > 100)//其他默认走8K
		{
			g_wVAType = cb8000VAModel;
            sSetBatteryPcs(cbBatt48VType);
            break;
		}
        else if(wElseBatt48VModuleCnt > 100)
        {
            g_wVAType = cb8000VAModel;
            sSetBatteryPcs(cbBatt48VType);
            //机型识别错误	
		    swSetModelFault(true);
            OSEventSend(cPrioSuper,eSuperFault);
            break;
        }
    }
	// g_wVAType = cb8000VAModel;
    // g_wVAType = cb10KVAModel;
	// g_wVAType = cb12KVAModel;
    // sSetBatteryPcs(cbBatt48VType);
}

/*-------------------------------------------------------------------------
Function Name: sUpsParaInit
Abstract: UPS parameter initial etc
Input   : None
Output  : None
History : 2014-12 Original design
-------------------------------------------------------------------------*/

