pwg-pwg/test/IVPMP2G2-PRO_APP/trunk/01_SourceCode/08_F2837xS_IVPMP2G2_APP/Source/APP/Initial.c
        //Battery and Charger Parameter Initial
        //sSetBatOpenVolt(cBat16v);           // 10048:
        //sSetBatOpenBackVolt(cBat36v);       // 10048:

        sSetBatOpenVolt(0);           // 10048:
        sSetBatOpenBackVolt(cBat36v);       // 10048:

        g_wFBInvLCurrRatio = 495;           // 10048://×?????óDê1ó?
        g_wChgEfficiency = 8800;            // 10048:if Charger Efficiency is 91.88%@80A
        g_wChgPara1 = 1064;                 // 10048:1A*700*1.414/92.97%;
        g_wDisChgEfficiency = 108;          // 10048:100/DisChgEfficiency = 108

        g_wBatMaxChgVolt = cBat63v;         // 10048:
        g_wSCCOverChargeVolt = cBat62v;     // 10048:
        g_wGridCurrMax = 470;               // 10048:47A
        g_wAcChgCurrMax = cIdc350A;//cIdc130A;//;            // 10048:80A

        //BUS soft start voltage
        g_wBUSSoftVoltTop = cBus464v;       // 10048:g_wBatMaxChgVolt*14.5;
        g_wBUSSoftVoltBotm = cBus305v;      // 10048:swGetBatteryPcs()*cBat11v*14.5

        //EEPROM Default table initial
        //pDefaultTable1 = sGetDefaultTable1();       // 10048:
        //pDefaultTable2 = sGet48V230DefaultTable2(); // 10048:Default PWM SCC Version
        pEeDefaultTable = sGet10KDefaultTable();

        //Watt/VA Rated
        wWattRated = c10KWattMaxPower;                  // 10048:
        wVARated   = c10KVAMaxPower;                 // 10048:
        wCurrRated = c10KInvMaxCurr;

        bCapaSize  = 150;                   // 10048:
        g_wDischgVoltSet = cBat52v;         // 10048:Aging Start Volt 52V
        g_wDischgCurrSet = cIdc120A;         // 10048:Discharge Current 80A

        wTxRatio = 2048;                    // 15048:230V:28.75.0V(Q8:230*256/28.75=2048)
        wBuckRatio = 225;                   // 15048:0.879*256  no use
        wInvNegPowerLimit1 = -2000;
        wInvNegPowerLimit2 = -1200;

		g_InvPriOCProPoint = PRI_OCP_PRO_POINT_10K;
	    g_InvPriOCRecProPoint = PRI_OCP_REC_POINT_10K;
        
    }
    else //if(g_wVAType == cb8000VAModel)
    {
        //ADC Ratio Initial
        DcSampData[PV1_VOLT].wSampRatio = 3008;//601/4096*10*2048
        DcSampData[PV2_VOLT].wSampRatio = 3008;//601/4096*10*2048
		DcSampData[PV1_CURR].wSampRatio = 5000; //66.67/2048*100*2048
        DcSampData[PV2_CURR].wSampRatio = 3750; //37.5/2048*100*2048
        DcSampData[PV_BUS_VOLT].wSampRatio = 4010;//802/4096*10*4096
        DcSampData[PV_PBUS_VOLT].wSampRatio = 4010;//802/4096*10*4096
        DcSampData[PV_NBUS_VOLT].wSampRatio = 4010;//802/4096*10*4096
		//DcSampData[PV_OUT_CURR].wSampRatio = 2025;//202.5/3*10*2048
        DcSampData[PV_OUT_CURR].wSampRatio = 2700;//270.0
		DcSampData[BAT_CURR1].wSampRatio = 5760;  //576*10
		DcSampData[BAT_CURR2].wSampRatio = 5760;  //576*10
		DcSampData[BAT_VOLT].wSampRatio = 4010;// 15048:
        DcSampData[BUS_VOLT].wSampRatio = 4010;// 15048:
        DcSampData[PV_ISO_VOLT].wSampleReal = 5115;// 511.5
        AcSampData[GRID_VOLT].SampCal.wSampRatio = 5013;// 501.3
        AcSampData[GEN_VOLT].SampCal.wSampRatio = 5013;// 501.3
        AcSampData[S_LOAD_VOLT].SampCal.wSampRatio = 5013;// 501.3
        AcSampData[OUT_VOLT].SampCal.wSampRatio = 5013;// 501.3
        AcSampData[OUT_L1_VOLT].SampCal.wSampRatio = 5013;// 501.3
        AcSampData[OUT_L2_VOLT].SampCal.wSampRatio = 5013;// 501.3
        AcSampData[INV_VOLT].SampCal.wSampRatio = 5013;// 501.3 
        AcSampData[GRID_L1_VOLT].SampCal.wSampRatio = 5013;// 501.3 
        AcSampData[GRID_L2_VOLT].SampCal.wSampRatio = 5013;// 501.3 
        AcSampData[INV_L1_CURR].SampCal.wSampRatio = 2000;// 306.3A
        AcSampData[INV_L2_CURR].SampCal.wSampRatio = 2000;// 306.3A
        AcSampData[OUT_L1_CURR].SampCal.wSampRatio = 2000;// 306.3A
        AcSampData[OUT_L2_CURR].SampCal.wSampRatio = 2000;// 306.3A
        AcSampData[GRID_L1_CURR].SampCal.wSampRatio = 2000;// 306.3A
        AcSampData[GRID_L2_CURR].SampCal.wSampRatio = 2000;// 306.3A
		AcSampData[GEN_L1_CURR].SampCal.wSampRatio = 2000;// 306.3A
		AcSampData[GEN_L2_CURR].SampCal.wSampRatio = 2000;// 306.3A
		AcSampData[S_LOAD_L1_CURR].SampCal.wSampRatio = 2000;// 200.0A
		AcSampData[S_LOAD_L2_CURR].SampCal.wSampRatio = 2000;// 200.0A
		
        //Converter factor Initial
        g_wConverterFactor = 80;            // 15048:Converter TX Boost ratio230/28.75

        //Inverter Factor Initial
        g_wInvOverCurrentFactor = 10;        // 15048:6.684444 = 4096*InvLCurrRatio/3
        g_wInvLCurrLineLevel1 = 1638;        // 15048:oóD?òa??2.40±????¨μ?á÷85A*6.68444->127.5
        g_wInvLCurrLineLevel2 = 1638;        // 15048:oóD?òa??2.20±????¨μ?á÷80.0A*6.68444->120

        g_wInvOverCurrRated = 150; //127;         // 15048:2.40±????¨μ?á÷     180A
        g_wInvCurrLimitRated = 145;//125;         // 15048:×?′ó?T??μ?á÷15k/170

        g_wInvCurrRated = cIac36A;          // 10048:???¨μ?á÷

        //Inverter Cntl Limit Parameters Initial
        g_wInvVCntlFactor = 251;             //Vmax/RefAd*2^5 15048
        g_wOPCurrCntlFactor = 184;           // 15048:31
        //g_wOPCurrCntlFactor = 153;
        g_wInvLCurrCntlFactor = 100;         // 15048:34

        //Battery and Charger Parameter Initial
        //sSetBatOpenVolt(cBat16v);           // 10048:
        //sSetBatOpenBackVolt(cBat36v);       // 10048:

        sSetBatOpenVolt(0);           // 10048:
        sSetBatOpenBackVolt(cBat36v);       // 10048:

        g_wFBInvLCurrRatio = 495;           // 10048://×?????óDê1ó?
        g_wChgEfficiency = 8800;            // 10048:if Charger Efficiency is 91.88%@80A
        g_wChgPara1 = 1064;                 // 10048:1A*700*1.414/92.97%;
        g_wDisChgEfficiency = 108;          // 10048:100/DisChgEfficiency = 108

        g_wBatMaxChgVolt = cBat63v;         // 10048:
        g_wSCCOverChargeVolt = cBat62v;     // 10048:
        g_wGridCurrMax = 470;               // 10048:47A
        g_wAcChgCurrMax = cIdc350A;//cIdc130A;//;            // 10048:80A

        //BUS soft start voltage
        g_wBUSSoftVoltTop = cBus464v;       // 10048:g_wBatMaxChgVolt*14.5;
        g_wBUSSoftVoltBotm = cBus305v;      // 10048:swGetBatteryPcs()*cBat11v*14.5

