pwg-pwg/test/IVPMP2G2-PRO_APP/trunk/01_SourceCode/08_F2837xS_IVPMP2G2_APP/Source/APP/Initial.c
        //EEPROM Default table initial
        //pDefaultTable1 = sGetDefaultTable1();       // 10048:
        //pDefaultTable2 = sGet48V230DefaultTable2(); // 10048:Default PWM SCC Version
        pEeDefaultTable = sGet8KDefaultTable();

        //Watt/VA Rated
        wWattRated = c8KWattMaxPower;                  // 10048:
        wVARated   = c8KVAMaxPower;                 // 10048:
        wCurrRated = c8KInvMaxCurr;

        bCapaSize  = 150;                   // 10048:
        g_wDischgVoltSet = cBat52v;         // 10048:Aging Start Volt 52V
        g_wDischgCurrSet = cIdc120A;         // 10048:Discharge Current 80A

        wTxRatio = 2048;                    // 15048:230V:28.75.0V(Q8:230*256/28.75=2048)
        wBuckRatio = 225;                   // 15048:0.879*256  no use
        wInvNegPowerLimit1 = -2000;
        wInvNegPowerLimit2 = -1200;

		g_InvPriOCProPoint = PRI_OCP_PRO_POINT_8K;
	    g_InvPriOCRecProPoint = PRI_OCP_REC_POINT_8K;
    }

    g_wBMSBaseVolt =(cBat10v*swGetBatteryPcs());
}


void sDelay4us(void)
{
    INT8U   xxx;

    for(xxx = 0; xxx< 60; xxx++)    //60 êμ2a120MHzê±100￡?5us,è?1?ó?óúIIC?ò??ó|100kHz?μ?ê
    {
        asm(" NOP ");
    }
}

void sDelay1ms(INT8U ms)
{
    INT8U   yyy;
    INT16U  xxx;

    for(yyy = 0; yyy < ms; yyy++)
    {
        for(xxx = 0; xxx < 25000; xxx++)    // êμ2a120MHzê±20000￡?1ms
        {
            asm(" NOP ");
        }
    }
}




/********************************************************************************
* Output interface Routines                                                     *
********************************************************************************/


/********************************************************************************
* Input interface Routines                                                      *
********************************************************************************/
